export const data = [
  {
    names: [
      {
        pinyin: "mò",
        character: "万",
      },
      {
        pinyin: "qí",
        character: "俟",
      },
    ],
    history:
      "<p>　　出自鲜卑族拓跋氏，北魏有十大贵族，“万俟”（Mòqí音莫奇）为其中之一。万俟本来是鲜卑族的部落名称，北魏朝是由道武帝拓拔珪创建，拓拔珪原是鲜卑君主的后代，在战乱中长大，他成年后，不失时机地召集父王的旧部，占地称王，扩展势力。东晋时，万俟部落随拓拔氏进入中原，后来就以部落名称作为姓氏。北魏君位传六王后，由献文帝拓拔弘继承，他的三弟之后，就是万俟氏的始祖。据《魏书》记载，头一个以“万俟”为姓的是万俟丑奴，是山西高平人。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　万俟普：北齐太平人，官朔州刺史。仁厚爱民，雄果有勇，官至太尉。<br>　　万俟洛：北齐的大将军，万俟普之子，气宇非凡，勇锐盖世，威名远扬。<br>　　万俟卨：宋代宰相，南宋奸臣，开封阳武人。他承秦桧之意弹劾岳飞，并编造假罪名置岳飞父子和张宪于死地；后又与秦桧争权，被罢黜。秦桧死后，他重任宰相，继续推行投降政策。<br>　　万俟咏：字雅言，里居不详。哲宗元佑间，即以词著名。绍圣中废科举，以三舍法取士，遂绝意进取，纵情歌酒，自号大梁词隐。每制一腔，哄传京中。徽宗崇宁年间召试补官，为大晟乐府制撰。高宗绍兴五年（1120年），补下州文学。其词多颂谀、风月之作，注重音律，构思新颖，风格淡婉工雅，其中《长相思》，《诉衷情》等词皆有名。原著《大声集》已佚。近人赵万里辑得其词二十九首。<br>　　万俟丑奴：山西省高平镇人，北魏末关陇人民起义领袖。匈奴族人。初为胡琛部属。琛死，代统其部众。建义元年自称天子，建元神兽。后兵败被杀。</p>\n</div>',
    distribution:
      "<p>　　（缺）万俟姓在大陆和台湾没有列入百家姓前一百位。关于万俟的姓氏来源，《魏书·官氏志》和《尚友录》都有记载。前者指出“后魏献帝季茅之裔”；后者则指出“后魏献帝季茅之后为十姓，魏书官氏志称万俟氏”由此可见，这个姓氏是南北朝五胡乱华时期才出现的，推算起来，至今仅有1700多年的得姓历史。实际上，“万俟”两个安本来是当时一个叫鲜卑族部落的名称，东晋时，鲜卑族的万俟部随拓跋氏进入中原，他们的酋长，是后魏献帝的弟弟。后来，由于鲜卑族逐渐被中华文化所同化，这个部落的后裔就以部落的名称作为自己的姓氏，称万俟氏，并且千秋万世地袭用下来。根据《魏书》记载，头一个以“万俟”为姓的是万俟丑奴，是山西高平人。望族居兰陵郡（今山西省高平）。《百家姓》注开封郡（今河南省开封市）。<br></p>",
  },
  {
    names: [
      {
        pinyin: "sī",
        character: "司",
      },
      {
        pinyin: "mǎ",
        character: "马",
      },
    ],
    history:
      "<p>　　１、源于西周，以官职为姓。上古时有人重黎，为司掌天地之官，唐尧曾抚育重黎之后。同宣王时，有重黎之后程伯休父，官至司马，执掌国家军队，佐政辅国，权势重大，程伯休父克平许方，立下大功，周王室允许他以官职为姓，其后遂成司马氏。<br>　　２、晋元帝司马睿，本姓生，改姓司马，其后亦为司马氏。<br>　　３、为许氏、郝氏所改。如许穆之、郝惔之即是。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　司马光：汉朝史学家、北宁大臣，字君实，陕州夏县人。宝元进士，官至天章阁待制兼知谏院。英宗时，进图龙阁直学士，献《通志》八卷，命设局续修。神宗初，任翰林兼侍读学士。《通志》赐名《资治通鉴》。为我国著名的编年史著作。司马迁：西汉史学家、文学家，字子长，夏阳人，太史令司马谈之子。初任郎中，元封三年继父任太史令，尽阅史官所藏旧史，又遍解，触怒汉武帝而下狱，受宫刑，出狱后，任中书令。仍发奋著书，历十二年，于征和二年，撰成我国第一部纪传体通史，时称《太史公书》。三国后，通称为《史记》。全书起黄帝，下迄汉武帝，总括三千余年史事，计一百三十篇，五十二万六千余字。<br>　　司马相如：西汉辞赋家，字长卿，成都人。景帝时为武骑常侍。</p>\n</div>',
    distribution:
      "<p>　　司马氏望出河内郡。楚汉之际置。在今河南省境内黄河北岸武县一带。</p>",
  },
  {
    names: [
      {
        pinyin: "shàng",
        character: "上",
      },
      {
        pinyin: "guān",
        character: "官",
      },
    ],
    history:
      "<p>　　出自芈姓，春秋时楚国有上官大夫，其后以邑名为氏。春秋时，楚怀王封他的小儿子兰为上官邑（今河南省滑县东南）大夫，子兰的后代子孙遂以邑名为姓，称上官氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　上官桀：汉朝人，武帝时任太仆。武帝临终时，任上官桀为左将军，与霍光同受遗诏辅佐少主，封为安阳侯。后来上官桀密谋欲废昭帝，但事情败露，被诛族灭。<br>　　上官仪：字游韶（约608-664），唐朝诗人，尤其善于做五言诗，在技巧上独树一帜，许多人都很赞赏，也有人模仿他的这种五言诗。当时这种写法称为“上官体”。上官仪举为进士后做官，但因反对武则天而冤死狱中。<br>　　上官洎：号惠安，唐僖宗乾符末镇将，与其子上官兰剿黄巢俱战死，封赠忠勇将军，敕建专祠名“惠安祠”。<br>　　上官凝：字成叔，邵武人。宋代文士，庆历二年（1042年）举为进士而做官，为人刚正纯直，不受馈赠，善决疑案，有政声。他的儿子上官均，孙子上官恢都举为进士。<br>　　上官均：字彦衡，宋熙宁三年（1070年）进士。策试时考官吕大临、苏轼拟其第一，以策中诋新法忤王安石，遂改第二。历官光禄寺丞、监察御史、龙图阁侍制，赠紫金光禄大夫。著有《曲礼讲义》二卷、《广陵文集》五十卷等。<br>　　上官音：字仲雍，政和二年进士。尚书吏部员外郎。著有《尚书小传》、《论孟略解》、《史统》、《史旨》等。<br>　　上官恢：字闳中，宋元丰五年进士，历知深州、南剑州、徽州。胡安国上书宰相，言其谙历世务，端重有守，遂与杨时同荐于朝。官至中大夫。<br>　　上官周：字文佐，号竹庄。长汀（今福建省长汀）人。布衣。与查慎行、黎士弘友善。善画山水，烟风弥漫，墨晕可观。查慎行题其罗浮山图，有“上官山人今虎头”之句，其推许可谓到矣。人物神情潇洒，于唐寅、仇英之外，别树一帜。刊晚笑堂画传，所画古今名人，各具神态。张浦山（庚）谓其有笔无墨，尚未脱闽皆也，人物工夫老到，亦未超逸。似非确论。兼精篆刻，能诗。著晚笑堂诗集。年至八十五尚作台阁风声圆。<br>　　上官婉儿：上官仪之孙女。上官仪父子因反对武则天执政被杀，婉儿与母亲被配入宫廷。婉儿辩慧能文，习吏事，武后爱之，拜婕妤（女官名），秉机政。她14岁起就为武则天草拟诏令。中宗李显即位后，她被立为昭容，掌管文学音乐，经常为皇后和公主作诗，韦后夺权失败后，被斩于旗下，时年46岁。<br>　　上官涣然：字文之，宋理宗淳祐元年（1241年）进士，历官至朝奉大夫、司农丞、右司郎。入仕30余年，家无余资。<br>　　上官涣酉：字元之，宋宁宗嘉定元年（1208年）进士。历知真州、池州、尚书佐郎、大理卿、右文殿修撰、朝议大夫等。</p>\n</div>',
    distribution:
      "<p>　　（缺）上官姓在大陆和台湾没有列入百家姓前一百位。上官源于芈姓，是以官职命名的复姓。从《元和姓纂》和《唐书·宰相世系表》上的记载可知，上官氏的得姓始祖，是春秋时代楚国庄王的少子子兰。这位公子兰，官拜上官大夫，以官为为氏而姓了上官。一说“上官”为地名，在今河南省滑县东南，其公族中人以封邑为氏。秦灭六国后，迁徙楚国公族大姓于关中，上官氏则被被迁往陇西上圭。《唐书·宰相世系表》记载说，汉时，为充实关中人口，朝廷曾下令将许多大姓迁往关中，基中上官氏被迁往陇西上圭。上圭，也就是今天的甘肃天水，这也正是源自楚国公族的上官氏在天水成为望族的缘由。唐时，上官氏已出现于中原的河南地区，并在河南的陕州出人头地。太宗贞观年间的文学家上官仪，就是陕州人。唐末纷扰，逼得中原民众大举南迁，上官氏的先人也受影响，很快就在今福建的邵武生根开花结果了。上官名人，唐有才女上官婉儿，宋有龙图阁一说“上官”为地名，在今河南省滑县东南，其公族中人以封邑为氏。秦灭六国后，迁徙楚国公族大姓于关中，上官氏则被被迁往陇西上圭。《唐书·宰相世系表》记载说，汉时，为充实关中人口，朝廷曾下令将许多大姓迁往关中，基中上官氏被迁往陇西上圭。上圭，也就是今天的甘肃天水，这也正是源自楚国公族的上官氏在天水成为望族的缘由。唐时，上官氏已出现于中原的河南地区，并在河南的陕州出人头地。唐末纷扰，逼得中原民众大举南迁，上官氏的先人也受影响，很快就在今福建的邵武生根开花结果了。上官在今河南滑省县东南一带。后来望族居天水郡，即今甘肃省通渭县西南。</p>",
  },
  {
    names: [
      {
        pinyin: "ōu",
        character: "欧",
      },
      {
        pinyin: "yáng",
        character: "阳",
      },
    ],
    history:
      "<p>　　出自姒姓，与欧姓同宗，以封地名、侯爵名为氏。<br>　　夏朝帝王少康的儿子无余，被封于会稽，建立了越国，为诸侯国。到春秋的时候被吴国灭亡。十九年后，勾践又复国。到勾践六世孙无疆为越王的时候，越国为楚国所灭，无疆的次子蹄被封于乌程欧余山的南部，以山南为阳，所以称为欧阳亭侯。无疆的支庶子孙，于是以封地山名和封爵名为姓氏，形成了欧、欧阳、欧侯三个姓氏。<br>　　在历史上，欧阳氏曾一度被迫改为单姓阳氏。据历史文献《宁远县志》的记载，元朝末年，各地农民纷纷起义反抗腐朽的元朝政府，当时即有一支欧阳氏家族为主的起义军。在明朝洪武元年(公元1368年)，明太祖朱元璋初安天下，曾意图招安欧阳氏义军。而欧阳氏全军上下拒降，明太祖大怒之下诏令诛灭欧阳氏家族，欧阳氏族人被迫分散逃亡，改为单姓“阳氏”以避其灾。直到后来的明武宗朱厚照执政时期(公元1506～1521年)，明正德三年(公元1508年)的进士并累官至右副都御史、巡抚应天(今江苏南京)等十府的一代名臣阳铎发明了“摊丁入地”之策(即后来明、清朝时期一直实施的“摊丁入亩”之策)，使明王朝税赋大增，明武宗由而大喜，阳铎遂乘机请旨要求恢复原姓，明武宗诏准，从此欧阳氏一族方得以恢复欧阳复姓。<br>　　欧阳氏族人皆尊奉夏禹、姒无疆为得姓始祖。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　欧阳宰勋在（前333—前）称王，<br>　　欧阳伟 在（公元前313—）称帝，<br>　　欧阳鸿业 在（公元前301—）（—称帝），<br>　　欧阳海宇 在（公元前291—）称帝，<br>　　欧安朱 在（公元前261—）（—称帝），<br>　　欧阳摇 在（公元前232—）称帝，<br>　　欧阳昭襄 在（公元前185.9—称帝，<br>　　欧阳建 前176—前163 （—称帝）。<br>　　欧阳生：名容，字和伯。汉千乘（今山东广饶县）人，曾从伏生学今文《尚书》，为博士，授倪宽。他的后代也多出学者，其曾孙曰高、高孙地余，地余孙曰歙，连续八代均为博士，世 代以研究《尚书》为特长，因此《尚书》世有欧阳氏学。<br>　　欧阳歙（公元前35年——39年）字正思，汉千乘（今山东广饶县）人。东汉光武帝宰相。为人廉恭礼让，以祖传“伏生尚书”任博士。王莽时任长社宰，后投更始刘玄任原武令。东汉建立后任河南尹，封波阳侯，后又迁升汝南太守。在汝南任官九年，教书育人，任用贤才，颇有政绩。光武帝建武十六年（公元40年）拜相，任大司徒。（摘自《中国历代宰相志》第35页）。<br>　　欧阳询（公元557——641年），字信本，潭州临湘（今湖南长沙）人，书法家。少孤，江总以故人子私养之。自少敏悟绝人，总数以书记。每读辄，目尽数行，遂博通经史。陈辟为东阁祭酒、五礼学士。陈亡入隋为太常博士。唐高祖征时，数以游。既即位，擢累给事中。素工书翰，飞白尤妙。初效羲之书，后险劲过之。因自名其体，尺牍所传，人以为宝。高丽常遣使求之。帝叹曰：“询之名遂满夷狄耶！”常见索靖所书碑，观之去数步复返。及疲遂布坐其下，三日乃得去。贞观初，历太子率更令、弘文馆大学士、银青光禄大夫，时太宗置弘文馆，精选文学士。询同虞世南、姚思廉、蔡允、萧德言等入直商榷政事，夜分乃罢，宠遇至渥，乃令。中书韩约、尚书高世廉等。访遍袁、吉、衡三州欧阳氏宗派，自晋渡江，同是一宗，撰成谱表，贞观三年敕付之。又奉诏书九成宫醴泉铭，字体清劲，至今为宝于世。并撰有《文艺类聚》百余卷及诸碑竭甚富。封渤海郡男，食邑五百户，赐紫金鱼袋，赠越州都督。卒年八十五，敕葬长沙乡书堂山。夫人徐氏，生四子：长卿、肃、伦、通。《唐书》有传。<br>　　欧阳通（公元620——691年）：字通师，一字通之。潭州临湘（今湖南长沙）人，询之子。唐武则天宰相。曾任中书舍人、殿中监、夏官尚书等职，封渤海子。武则天天寿二年（691年）拜相，任司礼卿兼判纳言事。初拜兰台郎，迁驾部郎中。仪凤中，迁中书舍人，怀州刺史，卫尉卿。居母丧，诏夺哀，每入朝徙跣及门，夜值籍蒿以寝，非公事不语，还家辄号恸，年饥未克，葬。居庐四年，不释服。冬月，家人以毡絮潜置席下，通觉，即撤去。累迁殿中监、兵部尚书、太常卿、刑部侍郎、金紫光禄大夫，封渤海子同中书门下平章事，武则天天寿二年（691年）拜相，任司礼卿兼判纳言事。辅政月余，会则天武后，欲废中宗立武承嗣，独立不语，洒泪进谏。忤旨被害。神龙初，奉敕清雪。复官爵，还家产，特立庙祀荫。一子官爵继嗣。通早孤，母徐教以书父书。惧其堕业，尝余钱使市父遗迹。通乃刻意临摹数年，书亚于询。父子齐名，号大小欧阳体。晚自矜重，以狸毫为笔，伏以兔毫，管皆犀象，非是未尝书。夫人胡氏，生子三：幼明、幼让、幼咸（因员公子、从弟欧阳韶配王氏无出，承父命特出继福建晋江潘湖欧阳韶为嗣）。《唐书》有传。（摘自《中国历代宰相志》第199页）<br>　　欧阳修（1007年－1072年），字永叔，号醉翁、六一居士，汉族，吉州永丰（今江西省吉安市永丰县）人，北宋政治家、文学家，且在政治上负有盛名。因吉州原属庐陵郡，以“庐陵欧阳修”自居。官至翰林学士、枢密副使、参知政事，谥号文忠，世称欧阳文忠公。后人又将其与韩愈、柳宗元和苏轼合称“千古文章四大家”。与韩愈、柳宗元、苏轼、苏洵、苏辙、王安石、曾巩被世人称为“唐宋散文八大家”。</p>\n</div>',
    distribution:
      "<p>　　欧阳氏复姓或是古老的汉族姓氏，在中国大陆的姓氏排行榜上名列第一百四十九位，在台湾省则名列第一百二十五位，人口约一百零八万三千余，占全国人口总数的0.067%左右，望族出渤海郡。欧阳姓（欧姓、区姓、阳姓）列入百家姓前一百位，位列宋版《百家姓》复姓的第4席，据公安部2009年身份证数据库数据，欧阳姓氏排名为60-70位，为300万人-500万人。其发祥地为渤海郡（今河北省沧县）。据《姓谱》载，越王勾践之后，支孙封于乌程欧阳亭(浙江湖州)，其子孙以此地名为姓。欧阳伟 在（公元前313—）称帝，欧阳摇 在（公元前232—）称帝，欧阳建在（前176—前163 ）（—称帝）。<br>　　今湖南省的长沙市、浏阳市、隆回县、东安县、宁乡市、衡阳市、攸县、常宁县、宁远县、永州市新田县，江苏省的淮安市金湖县、宿迁县，河南省的登封市、周口市、信阳市，福建省的福州市、晋江市，江西省的南昌市、新建县、萍乡市、新余市、彭泽县、星子县、宜春市、赣州市、吉安市、乐安县、永新县龙源口镇、永丰县、万载县，四川省的绵阳市、遂宁市、资阳市、什邡县、资中县，重庆开县、铜梁，贵州省的黔东南苗族侗族自治州台江县，山东省的招远市、枣庄市薛城区，广东省的广州市、从化市、江门市、河源县、揭阳市惠来县，安徽省的阜阳市、滁州市、宿州市萧县的欧集子，欧套村，湖北省的荆州市、襄樊市，枝江市、潜江市，广西壮族自治区的田东县、柳州市融水县、滕县，河南省的新郑市，等地，均有欧阳氏族人分布，其中湖北省枝江欧阳氏族为欧阳修长子欧阳发的后裔，而江苏省欧阳氏宗人大都居住在丹阳西门外荻塘欧甲(司徒)、下坯欧甲(全州)。至二十一世纪初，全市在籍的欧阳氏族人有一千五百余人。</p>",
  },
  {
    names: [
      {
        pinyin: "xià",
        character: "夏",
      },
      {
        pinyin: "hóu",
        character: "侯",
      },
    ],
    history:
      "<p>　　出自姒姓，以爵号为氏。周武王封夏禹的后裔东楼公于杞，春秋时建立杞国。公元前445年楚国灭杞，杞简公的弟弟佗逃往鲁国，鲁悼公因为他是夏禹的后代，周初祖先又封为侯爵，于是称他为夏侯氏，其后代子孙因以夏侯为氏，称夏侯氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　夏侯婴：西汉沛县人，与刘邦是少时的朋友，从刘邦起义，立下战功，后封为汝阴侯。<br>　　夏侯玄：三国魏人。弱冠为散骑黄门侍郎。曹爽辅政，玄为爽姑子，任魏征西将军，掌管雍凉州军事。司马懿杀爽，玄亦被废黜。后与中书令李丰、光禄大夫张缉谋杀司马师，事泄被杀，夷三族。玄规格局度，负一时重望，临斩东市，颜色不变，举动自若。<br>　　夏侯惇：三国魏人，曹操手下大将，自曹操陈留起兵起，便跟随征伐，历任东郡、陈留、济阴太守、河南尹等职；在曹操出兵征讨之时，夏侯惇总是负责防守后方，曾亲自搬运泥土修太寿陂，鼓励将士种田，发展农业，多有功劳。濡须口之战后，夏侯惇留守居巢，统领26支军队，为魏国东线主帅。曹操对夏侯惇格外亲近，经常邀请他一起乘车外出，并允许他自由出入自己的卧室，其他将领都得不到这种待遇。曹丕继位后，夏侯惇被封为大将军，不久病逝。<br>　　夏侯渊：三国魏人，是曹操手下大将，自曹操陈留起兵起，便跟随征伐，历任陈留、颍川太守。官渡之战后，夏侯渊负责粮草补给，保证了曹操平定北方。而后夏侯渊又率兵四处征讨叛乱，破昌豨、徐和、雷绪、商曜等，战功卓著，又随曹操平马超，灭张鲁，又破杨秋、刘雄、梁兴、韩遂、宋建等，再立奇功。而后夏侯渊督张郃、徐晃等留守汉中，与前来取汉中的刘备大军交战，在定军山为蜀将黄忠所袭，不幸战死。<br>　　夏侯霸：三国夏侯渊之子，在魏官至右将军、征蜀护军，屯住陇西，多次参见对蜀战争。后因司马懿政变，曹爽被杀，夏侯玄被调离，夏侯霸心不自安，投奔蜀国，被封为车骑将军，曾随姜维伐魏，后病逝于蜀国，得到追谥的荣誉。<br>　　夏侯湛：晋代散骑常侍。幼有盛才。文章宏富，善构新词，容颜俊美，曾与潘岳同车接茵，京都谓之连璧。<br>　　夏侯胜：西汉时东平（今属山东省）人。少随夏侯始昌学今文《尚书》，称“大夏侯”，常以阴阳灾异推论时政得失。宣帝立，大将军霍光令他用《尚书》授太后。后因与黄霸同时下狱，在狱中授黄霸《尚书》。遇赦出狱后，任太子太傅。受诏撰《尚书说》、《论语说》。他曾以《尚书》授其侄夏侯建，故《尚书》有大、小夏侯之学。<br>　　夏侯建：西汉今文尚书学“小夏侯学”的开创者。字长卿。东平（今属山东省）人。从夏侯胜和欧阳高学习今文《尚书》。称“小夏侯”。宣帝时，立为博士。官至太子少傅。著作已佚。清陈乔枞辑有《尚书欧阳夏侯遗说考》，收入《皇清经解续编》。<br>　　夏侯郎：隋代学者。开皇时，曾绘《三礼图》。<br>　　夏侯审：唐代御史，为大历十才子之一。<br>　　夏侯始昌：汉代鸿儒，甚为武帝器重，官至太傅。<br>　　夏侯嘉正：宋代词赋家。江陵人，太平兴国中进士，著作佐郎，使于巴陵，为《洞庭赋》。</p>\n</div>',
    distribution:
      "<p>　　（缺）夏侯姓在大陆和台湾没有列入百家姓前一百位。从《姓谱》和《唐书·宰相世系表》两书中的记载可以清楚的了解到夏侯氏的历史渊源。夏侯氏和单姓的夏氏本是一家，只是夏氏为兄，夏侯氏为弟罢了。春秋时代的杞国被楚国并灭之后（约于公元前445年），杞简公的弟弟佗逃往鲁国，鲁悼公因为他是夏禹的后裔，封他为爵侯，于是称他为夏侯氏。其后世子孙便以夏侯为姓。得姓历史应该是距今2400年左右。夏候氏的郡望为谯郡、鲁国郡。谯郡，东汉建安年间设置，其地在今安徽、河南二省之间。鲁国郡，西汉初将秦朝原有的薛郡改为鲁国，到三国魏及晋代又改为鲁郡，其地相当于今山东曲阜、泗水一带。</p>",
  },
  {
    names: [
      {
        pinyin: "zhū",
        character: "诸",
      },
      {
        pinyin: "gě",
        character: "葛",
      },
    ],
    history:
      "<p>　　1、出自葛姓所改。相传，伯夷的后裔葛伯的封国灭亡后，原居于琅琊郡诸县之葛氏有一支迁徙至阳都，因阳都已有葛姓，遂称后迁来的葛姓为诸葛氏。<br>　　2、出自有熊氏之后，为詹葛姓所改。春秋时齐国有熊氏之后有复姓詹葛，因读音讹为诸葛氏，后改为诸葛氏。<br>　　3、出自封赐所改。秦末陈胜吴广起义时，有大将葛婴屡立战功，却被陈胜听信谗言杀害。西汉文帝封葛婴的孙子为诸县侯，其后代遂以诸葛为姓，称诸葛氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　诸葛亮：三国时蜀国政治家、军事家。东汉末年，隐居邓县隆中（今湖北省襄阳西），留心世事。刘备三顾茅庐，他向刘备提出了占据荆（今湖南、湖北）、益（今四川）两州，联合孙权、对抗曹操，统一全国的建议（即“隆中对”），从此成为刘备的主要谋士。帮助刘备取得赤壁之战的胜利，占领荆、益两州，建立了蜀汉政权。刘备称帝，他任丞相。刘备死后，受遗诏辅佐后主刘禅。建兴元年，以丞相封武乡侯，兼领益州牧。他志在攻魏以复中原，乃东和孙权，南平孟获，而后出师北伐，六出祁山，与魏相攻战者累年，后病死于五丈原（今陕西省勉县西南）军中，葬定军山，终年54岁。有《诸葛武侯集》、《出师表》为其名篇。<br>　　诸葛瞻：三国蜀汉人，字思远，蜀汉景耀四年（261年）后主刘禅任瞻为行都护卫将军。两年后魏邓艾由阳平、江油入蜀，遣书诱降，诸葛瞻父子督军拒艾于绵竹关，父子双双英勇阵亡。<br>　　诸葛瑾：字子瑜，诸葛亮之兄。初为孙权长史，转中司马。孙权派遣诸葛瑾使蜀通好刘备，与诸葛亮俱公会相见，退无私面。后刘备伐吴，有人言其密遣亲人通蜀。孙权说：“子瑜之不负孤，犹孤之不负子瑜也。”孙权称帝，拜诸葛瑾为大将军、左都护、领豫州牧。<br>　　诸葛恪：三国时期吴国大臣。字元逊（203-253），琅琊阳都（今山东省沂南南）人。诸葛瑾之子。少时聪明过人，深得孙权的喜爱和器重。弱冠拜骑都尉，与顾谭、张休等侍太子孙登讲论道艺。当时丹阳地势险阻，盗匪藏于山中，无人敢任太守。恪主动请命，嘉禾三年（234年）拜抚越将军，领丹阳太守，一举治平。孙权卒，恪受顾命辅佐幼主孙亮，专国政。建兴元年（252年），出兵攻魏，坏魏军浮桥，水淹魏军数万，得军资如山。恪由此骄纵轻放。次年春，又北伐魏军于新城，数月不下，又值盛暑，士卒病者大半，怨声载道，被迫退兵。后为皇族孙峻所杀。<br>　　诸葛恢：字道明（265-326），晋代琅玡阳都（今山东省沂南）人。曾任安东将军司马睿（即后来的晋元帝）属下的从事中郎，后官至尚书右仆射。<br>　　诸葛丰：字少季，西汉琅琊县人，其里籍疑为今琅琊镇窝龙村（传言因纪念诸葛祖籍得名），或疑为葛陂（今诸城市枳沟镇普庆村南）。诸葛丰以明经为郡文学，特立刚直。贡禹为御史大夫时，以同乡召诸葛丰为属员，后举荐为侍御史。元帝擢为司隶校尉，刺举无所避，京城因而有语曰：“间何阔，逢诸葛。”就是说诸葛丰执法严正，害人者遂久阔而不相见。元帝嘉奖他的气节，加封诸葛丰为光禄大夫。时侍中许章以皇帝贵幸，淫奢而不守法规，其属下犯事，牵连及之。诸葛丰具文弹劾，正准备上奏，适逢许章私出，诸葛丰遂举符节令其下车，欲将其逮捕。许章逃入宫门，乞哀于天子。于是元帝收回诸葛丰的符节。诸葛丰不胜愤懑，上书辞职，元帝不许。是后所言益不被用。在位权贵多言其短，元帝降诸葛丰为城门校尉。最后上书弹劾光禄勋周堪、光禄大夫张猛，被元帝贬为庶人，终于家。诸葛丰之后代迁居阳都（今沂南县砖埠乡黄疃一带），多有显者，诸葛亮便是其中之一。<br>　　诸葛诞：字公休，琅琊郡阳都县（今山东省沂南）人。诸葛诞与诸葛亮同宗，初为尚书郎、荥阳县令。后来入朝任吏部郎、御史中丞、尚书。因魏明帝恶其沽名钓誉而罢官。曹芳继位之后复职，诸葛诞又任扬州刺史，加昭武将军。因讨伐毋丘佥等人叛乱而升任镇东将军、征东大将军，封高平侯。甘露二年（公元257年），朝廷为削弱其兵权而召入朝为司空，诸葛诞起兵反叛并投降吴国，在吴国出任左都护、大司徒、骠骑将军，封寿春侯，后被司马昭杀死。<br>　　诸葛融：字叔长，诸葛瑾幼子。瑾死后，承袭父亲的爵位。诸葛融宽待部属，辣受部属爱戴，在吴国官至奋威将军。兄诸葛恪被诛，追兵围城，诸葛融吞金自杀，他的三个儿子也被杀死。</p>\n</div>',
    distribution:
      "<p>　　（缺）诸葛姓在大陆和台湾没有列入百家姓前一百位。诸葛的起源说法不一。早在商朝，相传伯益的后裔葛伯，被封为诸侯，灭亡后，后世有一支迁居诸城（今山东省诸城），后迁至阳都（今山东省沂水县），当地已有葛姓，故后来的葛姓劝诸葛”二字为他们的姓氏。秦代葛婴（陈涉大将）在农民起义中屡立战功，却因谗言所害，遭杀身之祸，而后世汉武帝刘邦为其不平，隧赐其子孙为诸县候，由此，后人劝诸”及“葛”字，合姓“诸葛”；再一说，有“詹葛”一姓，在齐国人的语系里，“詹”与“诸”两音不分，时间长久后，误传为“诸葛”。诸葛复姓望族居琅邪郡。秦始皇时置郡。相当于现在山东省诸城县、临沂县、胶南县一带。</p>",
  },
  {
    names: [
      {
        pinyin: "wén",
        character: "闻",
      },
      {
        pinyin: "rén",
        character: "人",
      },
    ],
    history:
      "<p>　　起源于春秋时期少正氏。春秋时期，是奴隶社会过渡到封建社会的大变革时期。五霸争雄，大国兼并小国，奴隶起义反抗奴隶主的压迫和剥削等激烈的阶级斗争，反映在意识形态领域，出现了百家争鸣的局面，也揭开了我国历史上儒法斗争的序幕。春秋末期，鲁国的孔子和少正卯两个人都在开班讲学：以孔子为首的儒家学说，主张“克己复礼”，维护奴隶主阶级“礼治”的奴隶社会；以少正卯为代表的法家学说，主张变法革新，建立新兴地主阶级法治的封建社会。后来听少正卯讲学的人越来越多，其中包括孔子的学生也来了大部分，孔门出现了“三盈三虚”，气得孔子大骂少正卯是“小人之桀雄”。少正卯在讲学中很快成为了文人学士公认的“闻人”（意思是出名的人）。后来，孔子当上了鲁国的司寇，代行宰相职务，给少正卯加上“聚众结社；鼓吹邪说；淆乱是非”等罪名，把他捕杀了，并把他的尸体示众三天。但他变法革新的进步思想已经传播开了，奴隶制必定灭亡，封建制必定兴起。新兴地主阶级杰出代表秦始皇推行法制，于公元前221年统一了六国，建立了我国第一个地主阶级中央集权制的统一国家。少正卯的后代子孙就以“闻人”命姓，称闻人氏。得姓始祖：少正卯。据《风俗通》上考证，少正卯，鲁之闻人，是闻人氏的祖宗。闻人得姓至今已有2400多年的历史。其老家鲁国，即今山东剩传说古代春秋时期，鲁国有一位学都叫少正卯，他讲学进，孔子的学生中都有不少人去听讲，他的名声闻名远近，于是文人学士们就给了他一个雅号，叫闻人。闻人的后代将此引以为荣，就以闻人为姓，世代相传，因为只有这个姓，才能令人联想起少正卯当年指点江山，议论古今，意气风发，从学者如流的那种荣耀。而且少正卯与孔子后来矛盾极大，以闻人为姓，大约也是少正卯后代以少正卯的学术思想独树一帜为荣，望族居河内郡（今河南省武陟县西南一带），故闻人氏后人奉少正卯为闻人姓的得姓始祖。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　闻人宏：字君度，浙江省嘉兴人，二十岁人太学读书，大观年间进士，历官通州司法、天台兵曹、宣城知县、常州通判。有才名，善政，人高其德谊。著有《中兴要览》、《周官通解》、《经史旁阐》等。闻人诠：浙江省余姚人，明朝著名哲学家王阳明的学生。闻人诠和王阳明有亲族关系，是同辈，岁数小于王阳明，然在学业上是师生。闻人诠举为进士后，嘉靖年间做了御史官，巡视边疆，在山海关那一带修了近千里的长城。校补有《五经》、《三礼》、《旧唐书》行世。闻人通汉：字子方，浙江省嘉兴人，汉代学者，官太子舍人、中山中尉，习礼于孟卿，孟卿受礼于后苍。见汉书儒林孟卿传，类稿作“闻人通”，脱“汉”字。闻人梦吉：元朝人，浙江省金华人，潜心研学的著名学者。其父誢曾在王柏门下学习。梦吉受学家庭，手抄《其七经传疏》，闭户10年，洞究奥旨。泰定时在乡里中贡生，被荐为校官，累迁泉州教授。至正中授福建等处儒学提举，辞不赴。此外，闻人姓的名人还有：宋代有学者闻人宏、名人闻人祥正，明代有画家闻人益、闻人绍宗……等。</p>\n</div>',
    distribution:
      "<p>　　传说春秋时，鲁国有大夫少正卯聚徒讲学，几次将孔子的学生都吸引过去，被众人称为“闻人”，意为赞许其知识渊博、才华出众、闻名于世，后因与孔子政见不一，被当上鲁国司寇的孔子以“危言乱政”的罪名处死，其子孙为继承祖先的达名即以“闻人”为姓。也有一说鲁国大夫左丘明是古之闻人，其后人有以闻人为姓的。 <br>　　堂号中山堂：汉代时有中山中尉闻人通汉。后仓曾说《礼记》数万言，写成著作《后氏曲台记》，后教授给闻人通汉。通汉以太子舍人身份，在石渠阁（阁名，汉入关时所得秦国图籍皆藏于此，汉代是名儒讲经的地方）讲学。</p>",
  },
  {
    names: [
      {
        pinyin: "dōng",
        character: "东",
      },
      {
        pinyin: "fāng",
        character: "方",
      },
    ],
    history:
      "<p>　　1、远古时伏羲创制了八卦，八卦方位以东方为尊，伏羲又叫神农氏，他的族人务农，每天太阳从东方升起是个开始农作的重要时刻，于是伏羲的后代人中有的形成了东方姓，称东方氏。<br>　　2、出自张姓，是汉朝东方朔的后人。东方朔之父名张夷，在他出生前便去世了。母亲田氏在他出生三天后也死了。东方朔由其兄嫂抚养成人。因为他出生时东方天刚亮，所以取名叫东方朔。东方朔官拜太中大夫，他生性诙谐滑稽，出言幽默，但能洞察事理，直言切谏。他的后代亦以东方为氏，又形成一支东方姓。相声界尊东方朔为祖师爷。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　东方朔：汉代滑稽家，出入宫廷，文学修养很好，通晓世事，常借说笑话来劝谕皇上，深受上人们赞赏。据说他矮小，所以后人画东方塑都画成矮个。<br>　　东方虬：唐朝史官、诗人，唐代武后时任左史，工诗。武后游洛南龙门时，命随从文官赋诗，东方虬最先作好，武后赐他锦袍。<br>　　东方显：唐代学士，为开元中舍象亭十八学士之一。</p>\n</div>',
    distribution:
      "<p>　　（缺）东方姓在大陆和台湾都没有列入百家姓前一百位。“东方”是个古老的姓氏。早在远古时期，上古帝伏羲创立八卦，而他的后代孙仲，世掌东方青阳之令。古书记载，相传他出生的时候，“出于震，位主东方”，即根据八卦图推算是在震位，而震位表示为“东方”，因此，就以“东方”为姓氏。至汉武帝年间，著名文学家东方朔，本姓张，只因出世未三日，其母就病亡，而其父也已逝去多日了，邻居就根据他出生时东方天刚亮，起名为“东方朔”。而他长大后，名嘲一时，东方作为姓氏又得以巩固。东方朔为平原厌次（今山东省惠民）人，唐代时，东方姓已经成为平原郡的大姓望族之一。历史上的东方姓名人很多，还有东方虬、东方显等。东方虬为唐代史官、诗人，东方显为唐代文学家、开元十八学士之一。<br></p>",
  },
  {
    names: [
      {
        pinyin: "hè",
        character: "赫",
      },
      {
        pinyin: "lián",
        character: "连",
      },
    ],
    history:
      "<p>　　1、十六国时，南匈奴铁弗部勃勃称大夏天王，自称赫赫连天，以赫连为氏。据《晋书》所载：“刘元海之族也，僭称天王，书曰：朕之皇祖，自北迁幽朔，改姓姚，音殊中国，故从母氏为齐，子而从母之姓，非礼也，古人氏族无常，或以因生为氏，或以父王之名，朕将以义易之。帝王者，系为天子，是为徽赫，实在天连。今改姓曰赫连氏，庶协皇天之意，永享无疆大庆。系天之尊，不可令支庶同之。其非正统，皆以铁伐为氏。庶朕宗族子孙刚锐如铁，皆堪铁伐。”（刘元海之族，篡位自称天王，有诏书曰：我的先祖，从北方迁至幽朔后，改姓姚，与中原的姓氏不同音，故又随母亲姓齐。子孙随母姓是不合礼仪的。古代人姓氏不定，有随母姓的，有随父姓的，我现在要根据礼法改变这种习惯。帝王是上天之子，是显赫的徽记，天地相连的枢纽。故现在改姓称赫连氏，顺应天意，永享天下。天子位尊，不能与支庶同姓，其他非正统的子孙，皆以铁伐为氏。愿我的宗族子孙刚锐如铁，皆能征善战。）由此可以看出，自刘元海起，其后代遂以赫连为姓，称为赫连氏。<br>　　2、西晋至东晋时，吐谷浑族有赫连氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　赫连韬：唐代才子，福建省漳浦人，有不羁之才。与莆田的陈黯、王肱、萧枢、林贤、福州陈蔇、陈发、詹雄齐名，合称为“闽中八贤”。<br>　　赫连达：字朔周，盛乐（今内蒙古自治区和林格尔以北）人，赫连勃勃的后裔。他的曾祖父因避难改姓杜氏。赫连达性情刚强鲠直，有胆力。他年轻时跟随贺拔岳征战有功，被任命为都将，赐爵长广乡男，又迁任都督。初建六官制度时，赫连达被任命为左遂伯。后出任陇州刺史。周武帝保定初，迁任大将军夏州总管、三州五防诸军事。赫连达虽然不是文官，然而性情质朴正直，尊奉朝廷法度，虽多施用鞭刑，而对判处死罪十分慎重。他性格又很廉洁俭朴，边境的胡民有人送羊给赫连达，他想要与胡人相结交，就以缯帛进行回报。主管官员请求使用官物，他说：“羊进了我的厨房，不能用官库的东西谢人。”<br>　　赫连勃勃：十六国时期夏的创建者。南匈奴后裔，刘渊的同族。在位约十九年。北魏明元帝曾改其名为屈孑，意为卑下。原为铁弗部，勃勃称王后，以为帝王“徽赫与天连”，因而改姓为赫连氏。父刘卫辰，率部服属于苻坚，屯驻代来城（今内蒙古杭锦旗东），为北魏所灭。勃勃逃亡到后秦，受到姚兴的宠遇。任为安北将军、五原公，镇朔方（今陕西省延安）。407年，勃勃自称天王、大单于，国号大夏。据有河套之地，南境抵三城（今陕西省延安）和高平（今宁夏固原）。勃勃体格魁伟，雄略过人，而凶暴好杀。善于用兵，多次向西进攻南凉，向南进攻后秦，俘掠大量人口牲畜。413年，营建首都，蒸土筑城，铁锥如能刺进一寸，即杀工匠一并筑入。他说自己将要统一天下，君临万邦，因定城名为统万（今内蒙古乌审旗南白城子）。东晋将领刘裕灭后秦南归后，勃勃乘机南下，418年攻克长安，作为南都，自称皇帝，关中郡县都投降。425年赫连勃勃死。子赫连昌继位。427年，北魏攻取统万，次年，赫连昌被擒。431年夏亡。<br>　　赫连子悦：字士欣，十六国时夏的建立者赫连勃勃的后人，历官郑州刺史、林虑太守、都官尚书、太常卿。为官以清廉、勤奋自守，公正办事，又知道怎么做能使人民安居乐业康富，很受百姓拥戴。</p>\n</div>',
    distribution:
      "<p>　　（缺）赫连姓在大陆和台湾都没有列入百家姓前一百位。赫连姓源出历史上匈奴有此姓。因匈奴单于取汉室女子为妻，子孙跟随刘姓。古代汉朝时，北方有个匈奴族部落，首领叫右贤王刘去卑，他的一个后代又自称为夏王，并将刘姓改为赫连姓，意思是赫赫与天连接。那时匈奴族人对姓氏常作改动，和中原人的习惯不一样，也因为他们的社会形态也还落后些，权力和财产的承继关系也不稳定，所以姓氏的沿用也不稳定。西晋刘虎改为铁弗氏。东晋，刘虎曾孙勃勃称大夏天王，建国夏，又改复姓“赫连”氏。历史上吐谷浑族中也有赫连这个复姓的。</p>",
  },
  {
    names: [
      {
        pinyin: "huáng",
        character: "皇",
      },
      {
        pinyin: "fǔ",
        character: "甫",
      },
    ],
    history:
      "<p>　　1、出自西周，以官名为氏。西周太师（高级武官）皇甫的后代以“皇甫”为姓，称皇甫氏。<br>　　2、出自子姓，是春秋时宋国公族的后代，为皇父氏所改。西周后期宋戴公有个儿子叫公子充石，字皇父，宋武公时任司徒。当时有长狄鄋瞒部落进攻宋国，皇父领军反击，打退了长狄任，但皇父和两个儿子也不幸战死沙常后来皇父的孙子南雍陲以祖父的字为姓氏，称为皇父氏。其六世孙皇父孟子，生子皇父遇。秦国灭宋时，皇父遇逃至鲁国。西汉中期，皇父遇嫡系子孙皇父鸾，自鲁迁居陕西茂盛陵，把姓氏中的“父”字改为“甫”字（古代二字同音通用），遂成皇甫氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　皇甫嵩：东汉太尉。少好诗书，习弓马，灵帝时任北地太守，领冀州牧，拜太尉，封槐里侯，时号名将。<br>　　皇甫谧，魏晋间医学家，安定朝那（今甘肃省平凉西北）人。早年学儒，中年因患风痹疾，便开始钻研医学，写下《甲乙经》。该书阐述经络理论，明确穴位名称和位置，总结了晋以前的针灸学成就。<br>　　皇甫湜：唐代文学家。字持正，新安人。元和中擢进士第，为陆浑尉，仕至工部郎中。裴度辟为判官。集三卷，今存诗三首。<br>　　皇甫冉：唐朝天宝时状元。性聪敏，十岁即能文，张九龄呼为小友。与弟曾皆负诗名。著有《皇甫冉集》。<br>　　皇甫涍：明代诗人。好学工诗，与兄沖及弟汸、濂，皆有才名，时称皇甫四杰。官至浙江按察佥事。其后同里人张凤翼、燕翼、献翼并负才名，吴人因有“前有四杰，后有三张”之语。</p>\n</div>',
    distribution:
      "<p>　　（缺）皇甫姓在大陆和台湾没有列入百家姓前一百位。从《唐书·宰相世系表》的记载可知，皇甫出自子姓，宋戴公之子充石，字皇父，充石的孙子，以王父字为氏，遂姓皇父。汉朝时其后裔皇父鸾又改父为甫。这个历程，在《通志·氏族略》也有记载。以上文献资料说明皇甫氏的前身是皇父，是春秋时代宋国公族的后裔，大约已有2500年以上的得姓历史。这个姓发祥于现在的河南东部，其后子孙曾迁到鲁国，然后由鲁国迁往茂陵，即现在陕西省兴平县东北，而在当地发展成为名门望族。头一个把皇父改为皇甫的是汉代的皇父（甫）鸾，同时他是茂皇甫氏的开基始祖。望族居安定郡（今甘肃省固原县一带）。<br></p>",
  },
  {
    names: [
      {
        pinyin: "yù",
        character: "尉",
      },
      {
        pinyin: "chí",
        character: "迟",
      },
    ],
    history:
      "<p>　　南北朝时北方鲜卑族姓氏，以部落名命姓。前秦时期苻坚攻灭鲜卑拓跋部族，建立代国。后来拓跋邽复国，改国号为魏，史称北魏。与此同时，鲜卑族中又崛起一支尉迟部落，号尉迟部，如同中华之诸侯国。后来尉迟部随孝文帝进入中原，被命以族名尉迟为姓，称尉迟氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　尉迟迥：字薄居。北周孝闵帝时，因平蜀有功，封蜀公，驻益州。他素有大志，好施爱士，政绩卓著，为时人铭碑所颂。<br>　　尉迟纲：字婆罗，蜀国公尉迟迥之从兄。是宇文泰一手培植出来的将领，骁勇而有膂力，善骑射。卒于北周武帝天和四年（569年），享年五十三岁，谥周太保吴武公。<br>　　尉迟恭：唐初大将，字敬德（586-658），今山西省朔县人。隋朝末年，从军高阳，以武勇著称。曾随刘武周起事，后降唐，从太宗击败王世充、窦建德、刘黑闼等，武德初秦王李世民引为右府参军，屡立大功，是李世民亲信之一。玄武门之变，助李世民夺取帝位。太宗欲妻以女，敬德说：“臣妻虽陋，相与共贫贱久矣。臣虽不学，闻古人富不易妻，此非臣所原也。”帝乃止，以功累封鄂国公。<br>　　尉迟胜：唐朝于阗王珪长子。少嗣位，天宝年间来朝，玄宗以宗室女妻之，授右威卫将军。与高仙芝击破萨马播仙，加银青光禄大夫。至德初命其弟曜领国事，自率五千兵赴安禄山之乱，萧宗待之甚厚。广德年间拜骠骑大将军、于阗王，令回国，尉迟胜固请留宿卫。加开府仪同三司，封武都王。<br>　　尉迟乙僧：于阗（今新疆维吾尔自治区和田县）人，唐代画家。与其父尉迟跋质那（画家）皆以善画闻名，有大小尉迟之称。<br>　　尉迟跋质那：唐氏画家。于阗人，与子乙僧并称为“大小尉迟”。善画外国风俗及人物、佛像、宝树，尤擅画黄犬及鹰，当时印度佛教艺术传入中原，如印度僧人昙摩拙义、跋摩便是对大小尉迟有重要影响的人。画迹有《降魔》、《变相》等壁画，作于东都寺院,著录於《京洛寺塔记》；《六番图》、《婆罗门图》、《外国宝树图》，著录于《历代名画记》。</p>\n</div>',
    distribution:
      "<p>　　（缺）尉迟姓在大陆和台湾没有列入百家姓前一百位。尉迟，本来是南北朝时来华的鲜卑族部落的名称。距今1600年前，这个部落随同同族的拓跋氏跑到中原来打天下，经过长时期的东征西战，拓跋氏终于当上了皇帝，于是尉迟部也就身价百倍，成了北魏皇室的一个诸侯。后来，北魏皇帝为博大精深的中华传统文化所折服，极力推行中华文化，学习汉俗，连皇帝的姓氏都由原来的拓跋氏改为元氏，同时还下令其族人也一律改为汉姓，尉迟氏便是在这种情形下，以部落的名称作了家族的姓氏，而称尉迟氏。尉迟复姓望族居太原，战国时秦国置郡，相当于现在山西省太原市。</p>",
  },
  {
    names: [
      {
        pinyin: "gōng",
        character: "公",
      },
      {
        pinyin: "yáng",
        character: "羊",
      },
    ],
    history:
      "<p>　　出自姬姓，以祖上名字为氏。据《尚友录》上指出，公羊氏家族，是先秦时期鲁国的公孙羊孺之后，“以王父字为氏”而得姓。春秋时，鲁国有位才学出众的人物，叫做公孙羊孺，他的后代子孙便取祖上名字中公羊二字为姓，称公羊氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　公羊高：战国时候的著名学者，齐国人，承继发扬孔子的儒学，为卜子夏高徒，他讲学有《春秋传》一书，也叫《春秋公羊传》或《公羊春秋》，专门阐释春秋，最初只有口头流传，到汉初，他玄孙公羊寿，邀集了研究公羊高的学者，辑录成《春秋公羊传》。何休又作《解诂》十一卷。多发明《春秋》微言大义，大张三世（据乱世、升平世、太平世）之说，为天下文人学士看重，传播很广，成为儒学“十二经”之一。这十二经是：《易经》、《书经》、《诗经》、《周礼》、《仪礼》、《礼记》、《春秋左传》、《春秋公羊传》、《谷梁传》、《论语》、《孝经》、《尔雅》。《公羊传》是今文，盛行于汉武帝、汉宣帝之时。自王莽时，古文大盛，公<br>　　羊传渐少人研究。到清代后期，庄存与、刘逢禄、龚自珍、魏源、康有为等主张复兴今文学，借用公羊传“微言大义”来说经，议论时政，对当时学术界影响很大。<br>　　公羊寿：公羊高之玄孙。他与胡母生（子都）一起将《春秋公羊传》“著于竹帛”。《公羊传》有东汉何休撰《春秋公羊解诂》、唐朝徐彦作《公羊传疏》、清朝陈立撰《公羊义疏》。《公羊传》的主要精神是宣扬儒家思想中拨乱反正、大义灭亲，对乱臣贼子要无情镇压的一面，为强化中央专制集权和“大一统”服务。《公羊传》尤为今文经学派所推崇，是今文经学的重要典籍，历代今文经学家都常用它作为议论政治的工具。它也是研究战国、秦、汉间儒家思想的重要资料。</p>\n</div>',
    distribution:
      "<p>　　（缺）公羊姓在大陆和台湾没有列入百家姓前一百位。公羊一姓出自姬姓。根据《尚友录》上指出，公羊氏家族，是先秦时期鲁国的公孙羊孺之后，“以王父字为氏”而得姓。《通志·氏族略·以字为氏》也介绍，春秋时鲁公孙羊孺，颇有才学，基孙以祖父名字中的两个字“公羊”为氏。使公羊姓为姓氏人所知的人物是战国时人公羊高。相传他是《春秋公羊传》的作者。不过，有学者认为《春秋》三传之一的《公羊传》，起初只是口头流传，进到西汉景帝时才由公羊高的玄孙公羊寿和齐人胡母生（字子都）将其“著于竹帛”面成书流传后世。依照《尚友录》的记载，公羊氏家族当时的繁衍中心是在顿丘，即今河北省清丰县西南一带。<br></p>",
  },
  {
    names: [
      {
        pinyin: "tán",
        character: "澹",
      },
      {
        pinyin: "tái",
        character: "台",
      },
    ],
    history:
      "<p>　　出自春秋时鲁国孔子弟子灭明的后代，以地名为氏。春秋时有鲁国孔子的弟子，字子羽，名灭明，南游长江流域，居于澹台湖（在今江苏省吴县）；另一说是居于澹台山（今山东省嘉祥县南），遂以湖（山）名命姓名，因取名澹台灭明。其后代子孙遂以澹台命姓，称澹台氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　澹台灭明：春秋末年鲁国武城（今山东省平邑县南）人。姓澹台，名灭明，字子羽，孔子七十二弟子之一。其相貌丑陋，但为人公正，非公事不见卿大夫，受到孔子的推崇。据《史记·仲尼弟子列传》说他“行不由径，非公事不见卿大夫”。后来游学于江淮，弟子多达300人，名扬各诸侯国。因其貌丑，孔子开始曾以为才薄，当发现其优点后，则自称“以貌取人，失之子羽”。唐开元二十七年（739年）追封“江伯”。宋大中祥符二年（1009年）加封“金乡侯”。明嘉靖九年（1530年）改称“先贤澹台子”。<br>　　澹台敬伯：东汉名士，又名澹台恭，会稽人。向薛汉为师学习《韩诗》，为薛汉最知名的弟子之一。薛汉的弟子中，以澹台敬伯与杜抚、韩伯高等最为知名。</p>\n</div>',
    distribution:
      "<p>　　（缺）澹台姓在大陆和台湾没有列入百家姓前一百位。澹台姓起源于春秋时候，鲁国地名为澹台山（今山东省嘉祥县南），后来有孔子的弟子，字子羽，名灭明，相貌丑陋，但品行端正，喜欢这里的风景并居住于此，就以山名作为自己的姓氏，故叫澹台灭明。他的后代，就承继澹台为姓，世传澹台氏。另一种说法，也是源于地名，但是一名为澹台的湖泊。书载，灭明南下游历各地，曾居于澹台湖滨，并以湖名为姓。后人因之。澹台氏如今并不多见，许多澹台氏早就简化成台氏了。澹台姓望出太原郡，战国时秦庄襄王置郡。治所是晋阳，在今山西省太原市西南。</p>",
  },
  {
    names: [
      {
        pinyin: "gōng",
        character: "公",
      },
      {
        pinyin: "yě",
        character: "冶",
      },
    ],
    history:
      "<p>　　出自姬姓，为季氏的后代，以祖字为氏。根据《国语注》上记载，春秋时鲁国有季孙氏，族子季冶，字公冶，季氏的始祖便是季冶，官拜大夫，他的子孙后来便以公冶为氏。公冶氏是十分古老的一个复姓，这个复姓迄今大约有2500年以上的历史。由上可知，公冶氏发祥于当时的鲁国，系出鲁国大族季氏之子季冶，由于季冶字为公冶，其子孙“以王父字为氏”而姓了公冶。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　公冶长：字子长，春秋末期齐国人，孔子弟子。据《论语》的20篇中，有一篇名为“公冶长”者，首载孔子论公冶长之为人。据说公冶长不但以贤而著称，而且能通鸟语，多才多艺。后代人认为是吉祥，就画作年画。</p>\n</div>',
    distribution:
      "<p>　　（缺）公冶姓在大陆和台湾没有列入百家姓前一百位。公冶这个复姓迄今大约有2500年以上的历史。春秋时，鲁国季氏是一个屡出君主的名门旺族。在季族家族中，有一个名叫季冶，字公冶，曾为季氏属大夫。他的字就是公冶姓氏的起源。还有部分公冶氏的人是继承孔子的弟子公冶长的姓氏的。和许多复姓一样，公冶姓氏也向再单姓转变，后来逐渐被公氏所代替。公冶氏望出鲁郡。主要分布在现在山东省曲阜、泗水一带地区。<br></p>",
  },
  {
    names: [
      {
        pinyin: "zōng",
        character: "宗",
      },
      {
        pinyin: "zhèng",
        character: "政",
      },
    ],
    history:
      "<p>　　出自刘姓，是汉高祖刘邦的后代，以官名为氏。据《通志·氏族略》上记载“汉楚元王交之孙刘德为宗政。”汉朝开国皇帝刘邦的后代有楚元王刘交，他的孙子叫刘德，官至宗正，为九卿之一，即主持皇家宫室事务的官员。刘德的支庶子孙有的以祖上官职名命姓，称宗正氏，后来加文而为宗政氏。宗政姓族人，今大多已并入宗姓。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　京兆郡：即首都直辖区。汉武帝时改右内史置京兆尹，为“三辅”之首。治所在长安（今陕西省西安市北）。三国魏时置京兆郡名。<br>　　彭城郡：指今江苏徐州。传尧封彭祖于此，为大彭氏国。秦置彭城县。西汉后期一度以楚国为彭城郡。东汉建彭城国。以后或为彭城郡，或为徐州，均治彭城。彭城县于元初撤销，并入州治。</p>\n</div>',
    distribution:
      "<p>　　（缺）宗政姓在大陆和台湾没有列入百家姓前一百位。宗政即是宗正。宗正，是官名，从秦始皇开始设立，乃秦汉之时九卿之一，主管的是皇族的有关事务。汉高祖刘邦弟弟刘交被封为楚元王。楚元王的孙子刘德出任宗正，出入皇宫自由，管理的都是皇事，十分令众人羡慕。据《通志·氏族略》上记载“汉楚元王交之孙刘德为宗政”，由此可知，刘德因任宗正之官，其后世子孙“以官名为姓”，称宗正氏，后称宗政氏。得姓至今已经有2000多年的历史了。宗政姓氏在中国姓氏中不是太多，皆因后来“宗政”氏的大部分族人，也逐渐转变简为“宗”姓。宗政姓望出京兆郡（今陕西省西安以东至华县一带）、彭城郡（今江苏省徐州市）。</p>",
  },
  {
    names: [
      {
        pinyin: "pú",
        character: "濮",
      },
      {
        pinyin: "yáng",
        character: "阳",
      },
    ],
    history:
      "<p>　　出自姬姓，颛顼的后代以地名为氏。古代有一条河叫濮水，濮水南岸一块丰饶的地方叫濮阳，那地方，就在现今的河南濮阳市。远古时，这地方也叫帝丘，黄帝的孙子颛顼做部落首领时，曾在这儿建都；春秋时卫成公也曾在此定都，是一处文化宝地。颛顼的后代中有人居住在濮水南岸，后来就取地名为姓，世代姓濮阳。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　濮阳兴：三国时吴国的文官。字子元，少有士名，孙权时使蜀，做过会稽太守。吴国君主孙权的第六儿子，名叫孙休。濮阳兴和孙休是好友。后来孙休继位，称景帝，就任用濮阳兴做丞相，封外黄侯。永安中休卒，万或劝兴迎立程侯皓，加侍郎，领青州，俄为或所谮，徙广州，道追杀之，夷三族。<br>　　濮阳成：明朝武将，沉毅有远志，累立战功，朝廷封他世袭金山卫百户，为武德将军。<br>　　濮阳瑾：明朝文士，因科举成绩优良而被任为地方官，在山东宁阳县任县丞，政尚宽平，赈饥有功，远近赖以全活。<br>　　濮阳来：明嘉靖年间出任南昌府通判，以操履清白而见称。</p>\n</div>',
    distribution:
      "<p>　　（缺）濮阳姓在大陆和台湾都没有列入百家姓前一百位。濮阳原为地名，当地有一条河流名濮水，此河的南岸按习惯就称之为濮阳（古代河之南岸为阳），即今河南省濮阳县。最现是古部落首领颛顼（传说他是黄帝的子孙）的后人于此居住过，当地人就以地名为姓，流传下来。春秋时，卫国郑大夫居于濮水之北，也有说其封地于濮水之南，后人就以濮阳为姓。从《姓氏考略》上考证，濮阳的先祖居于澶州，后以地为氏，望出广平。同样《通志·氏族略》上亦有“濮阳氏，其地在澶州，后汉外黄令牛述，以濮阳潜为主簿。”的记载。古代的澶州，在今河南省濮阳市南方。“濮阳”是一个具有悠久历史的地名，在2000多年前的战国时代便已出名，这个地方位于今河南省南隅，黄河的西北。相传上古的颛顼帝陵仍为我国的著名古迹之一）。颛顼帝的后世子孙有居住于此地的，因而以地为氏，称濮阳氏。望族居博陵郡（今河南的濮阳市，古称澶州）；平陵郡（今山西文水县东一带）。<br></p>",
  },
  {
    names: [
      {
        pinyin: "chún",
        character: "淳",
      },
      {
        pinyin: "yú",
        character: "于",
      },
    ],
    history:
      "<p>　　出自姜姓，是炎帝的后代，以国名为氏。周武王灭商后，把原夏朝斟灌国姜姓淳于公封在州邑（今山东省安丘县），建立州国，因位居公爵，世称州公。春秋时期有州公实，亡国于杞，州国公族定居于淳于城（今安丘县东北，原为州国都城），后来复国，名淳于国，仍为公爵，成为春秋时期的小国之一。亡国后，其族人以原国名命姓，称淳于氏。到唐代中期，唐宪宗名李纯，淳于姓的“淳”字与“纯”字同音，遂在避讳之列，乃去淳为于姓。五代以后，有于姓恢复祖姓，仍复姓淳于。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　淳于髡：战国时齐国文士。博学多闻，知识丰富，口才好，善于答辩，说话幽默滑稽。当时诸侯并侵，百官荒乱，淳于髥游说于各诸侯国之间，说之以隐，并见听从，以为诸侯主客。<br>　　淳于越：战国时齐国博士。李斯和淳于越是一对好兄弟，身居相位的李斯，为了迎合秦始皇统一言论的需要，上表焚书，当即遭到太子老师、博士淳于越的反对。李斯意识到，焚书之议势在必行，却又担心性格耿直的淳于越强谏惹祸，想方设法劝导他，可是淳于越还是触犯了律令。在李斯的袒护下，淳于越免于死罪，革职回乡。为了保护储君，在回乡路上，他又为扶苏代言，泣血上表，谏阻焚书，终于招来杀身之祸。在刑场上，监刑官李斯和死囚淳于越互吐心声，阐明各自的人生观。淳于越舍生取义，与诗书共存亡，死得坦然；李斯保住了禄位，却遭受天下读书人的唾骂。<br>　　淳于量：字思明，南朝陈车骑将军。其先济北人，世居京师。父文成，仕梁为将帅，官至光烈将军、梁州刺史。淳于量少善自居处，伟姿容，有干略，便弓马。梁元帝为荆州刺史，文成分量人马，令往事焉。起家湘东王国常侍，兼西中郎府中兵参军。累迁府佐、常兼中兵、直兵者十馀载，兵甲士卒，盛于府中。荆、雍之界，蛮左数反，山帅文道期积为边患，中兵王僧辩征之，频战不利，遣量助之。量至，与僧辩并力，大破道期，斩其酋长，俘虏万计。以功封广晋县男，邑<br>　　三百户，授涪陵太守。历为新兴、武宁二郡太守。<br>　　淳于恭：字益孙，东汉北海淳于人，清净不慕荣利。他的哥哥被盗贼虏去，将要被烹，他要求替哥哥死，盗贼很感动，把他们兄弟二人都放了。淳于恭在家不愿出门，朝廷拜他为议郎之侍中。淳于恭的哥哥淳于崇死后，淳于恭亲自抚养哥哥留下的儿子，他教侄儿读书学习，侄儿如果做错了事，淳于恭就用棍子打自己以感化侄儿。侄儿看了非常惭愧，并且改正自己的错误。<br>　　淳于长：字子鸿，西汉魏郡元城（今河北省大名）人。其父族虽无权势，但母族十分显赫：其姨娘王政君，是元帝刘奭的皇后，成帝刘鷔的皇太后；其大舅王凤是大司马、大将军；二舅王谭、三舅王商、四舅王立、五舅王根和六舅王逢，也于同一天分别被封为平阿侯、成都侯、红阳侯、曲阳侯和商平侯，一时有"五侯"的盛名。基于此，他20来岁便当上了黄门郎，可以出入于宫廷之中，往来于显贵之间。从此，他竭尽阿谀奉承之能事，千方百计地接近和讨好成帝，渐渐取得了成帝的信任，很快升为卫尉，成为九卿之一。<br>　　淳于诞：后魏时蜀汉人。他的父亲兴宗为南安太守。他十二岁时随父亲前往扬州，但在路上其父被盗贼所害，他倍感哀伤，誓要奋发，倾资财结交宾客，半月内遂得复仇，破贼樊文炽等。官终梁州刺史。<br>　　淳于棼：为唐李公佐著《南柯太守传》中的故事人物，叙述主人公淳于棼与二友酒醉、入梦，在大槐安国招驸马，任太守，煊赫一时，后因战败，公主又死，国王怀疑，有人构陷，被送回乡，梦醒时二友正在床边洗脚，即以虚幻曲折的故事情节，讽刺沉迷仕禄的士人，揭露了封建官场互相倾轧的情况。<br>　　淳于朗：唐代黄县人，淳于难之弟，武德年间随兄难入朝，因以佐命，官菜阳剌史、后宰相，封燕国公。<br>　　淳于难：黄县人，隋时据守文登。唐兴降唐，文登遂升为州，以难为刺史，封晋国公。<br>　　淳于意：山东人，汉代名医，仕齐为太仓长，世称为太仓公或仓公。少喜医术，后为人治病，决生死多验。文帝时，因故获罪，当处肉刑，其女缇萦上书，愿以身入宫为婢，代父赎罪，文帝悲其孝心，因废肉刑。<br>　　淳于缇萦：汉代名医淳于意之女，她的父亲医道很好，因被豪商诬告，判下肉刑的重罪。缇萦主动随父亲进京，上书朝廷，并自愿献身为奴，抵赎父亲的刑罚。汉文帝被她的孝心所感动，终于下令赦免其父，并废除了肉刑的法令。</p>\n</div>',
    distribution:
      "<p>　　（缺）淳于姓在大陆和台湾没有列入百家姓前一百位。上古周武王建立周朝后，将远古时的炎帝的后代人，封于州邑，让他们建立了州国。还同时封为公爵，于是州国的君主就称为州公。州国那地方，就在现今山东省安丘县。安丘县的东北边，至今还有个淳于城，这个淳于城，原来就是州国的都城。州国经一度亡国又复国，复国后就称为淳于国。再以后，淳于国的公族后代就以国名为姓了。淳于氏望族居齐郡（今山东省临淄县一带）。后来因徙迁，有的于河内郡为望族（今河南省西部黄河以北一带）。</p>",
  },
  {
    names: [
      {
        pinyin: "chán",
        character: "单",
      },
      {
        pinyin: "yú",
        character: "于",
      },
    ],
    history:
      "<p>　　出自匈奴王族姓氏，以最高首领冠称为氏。历史上匈奴族的最高首领称为“撑犁孤涂单于”（字意为“天子广大”，意为称颂首领的权力是神授的，他们应拥有天子的广大辽阔的尊敬及势力），简称为单于，他们的后代中有以“单于”为姓氏的，称单于氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　历史上以单于为姓的名士并不多见，主要原因，可能是受大汉族主义思想的影响，认为用外来种族的姓氏在社会上没有地位和常驻歧视。就连《中国名人大辞典》也没有收录到一个此姓氏的历史名人。</p>\n</div>',
    distribution:
      "<p>　　（缺）单于姓在大陆和台湾都没有列入百家姓前一百位。单于氏这一姓氏出现于后周时期，得姓至今有1000多年的历史。在汉朝，匈奴部落频繁与汉朝进行经济，文化，外交上的往来，于此，单于作为姓氏的一种也传入了中原。还有同是汉朝时，左贤王降汉时仍以汉为姓。后来大部分的单于氏族人也简化为单氏，同时此姓的发音也随之发生变化，由单于（Chányú音潺渔），变为单（Shàn音善）。据考证，单于氏也并没有绝迹，现今主要分布在山东的历城、益都，湖北省等一带，自古以来就有不少姓单于的人家，这也可能是宋本《百家姓》上出现单于一姓的自然原因吧。单于姓望族居千乘郡（今山东省高苑县北一带）。</p>",
  },
  {
    names: [
      {
        pinyin: "tài",
        character: "太",
      },
      {
        pinyin: "shū",
        character: "叔",
      },
    ],
    history:
      "<p>　　1、出自姬姓，是卫国开国始祖康叔的后代，以祖上次第排名为氏。春秋时，卫国国君卫文公姬毁的第三个儿子叫姬仪。在古代，兄弟以伯仲叔季为次序来排名，姬仪因为排行老三，所以人称叔仪，又因为他是王族之后，所以世称太叔仪。他的后代子孙以祖上的次第排名字命姓，称太叔复姓。<br>　　2、亦出自姬姓，以祖上封号为氏。春秋时，郑庄公名叫寤生，他的弟弟叫作段，被封在京，世称京城太叔，其后代子孙遂以祖先封号命姓，称太叔复姓。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　太叔仪：古代春秋时期，卫国有一位周朝的王族后代叫姬仪，姬仪排行第三，也就是卫文公姬毁的第三个儿子。古时候，兄弟辈排行次序，老大称伯，老二称仲，老三称叔，老四称季。姬仪为老三，就称作叔仪。而姬姓源自周朝王族，（周文王叫姬昌，周武王叫姬发）于是外人称呼叔仪时为表示尊敬，就称他太叔仪。太叔仪的子孙，以先辈的身份为荣耀，世代姓太叔。<br>　　太叔段：春秋郑国人。郑武公少子，庄公弟。母爱而欲立为太子，武公不许。在古代，太叔这样的尊称是被普遍采用，称呼王公贵族中排行三的子弟，而也可能被子孙延用演变成姓氏。见于古书记载的春秋时郑国有一位京城太叔，他也是周朝姬姓王族的后代，名叫段，受封于京城。他的后代就取京城太叔中的“太叔”两字为姓。</p>\n</div>',
    distribution:
      "<p>　　（缺）太叔姓在大陆和台湾都没有列入百家姓前一百位。太叔姓并不多见，源起皇族姓氏。一是出自姬姓。春秋时期，卫国国君卫文公的第三子名仪，而卫文公是周朝的王族后代。按古时的排序规则，三子应为叔字（古时候，兄弟辈排行次序，老大称伯，老二，三，四分别是仲，叔，季）。因此，仪又称作叔仪。为表示对周室皇族的尊重，他人称呼叔仪时都加个“太”字，即为太叔仪。太叔仪的子孙，以此身份为荣耀，改姓太叔。后来，太叔这个称呼在贵族中流传。凡王公皇室贵族中排行三的子弟，都称之为太叔，他们的子孙也演变为越来越多的太叔氏。二是出自春秋郑庄公之弟段，他也是周朝姬姓王族的后代，受封于京城，众人称之为京城太叔。他的后代就取太叔两字为姓。太叔氏望出东平郡（在今天山东省东平、泰安一带），这个姓氏到了秦汉以后便逐渐少见。</p>",
  },
  {
    names: [
      {
        pinyin: "shēn",
        character: "申",
      },
      {
        pinyin: "tú",
        character: "屠",
      },
    ],
    history:
      "<p>　　1、为上古舜帝的后代。初为胜屠氏，后因古代“胜”与“申”两字同音，故俗称申屠氏。<br>　　2、出自姜姓，为炎帝裔孙四岳的后代。夏朝时，四岳之后被封于申，为侯爵位，世称申侯。西周末年的周幽王是个荒淫无道的昏君，他先娶申侯的女儿为王后，后来又宠幸美女褒姒，废掉申后和太子宜臼，改立褒姒所生的伯服为太子。申侯对此大为不满，便联合鄫国和游牧民族犬戎一起攻打周幽王。敌兵压境，周幽王赶紧点燃烽火，召唤各国诸侯前来援救，可是等来等去，一路援军也没有来。原来，褒姒虽美，却难得开口一笑。为此周幽王立下重赏：凡能够使褒姒开口一笑者赏赐千金。有小人就出了个馊主意，叫周幽王点起烽火戏弄诸侯。周幽王依计而行，果然引得各国诸侯来时急如星火，去时败兴而归，乱哄哄，闹嚷嚷，倒也使褒姒笑过几次。可是一来二去，诸侯们也学乖了，所以到后来来的诸侯越来越少了，这次真的情况紧急，各国诸侯却以为周幽王又在做游戏，所以都不肯来了。结果周幽王和伯服被犬戎杀死，褒姒也被掳走。于是申侯同鲁侯、许侯等拥立宜臼为王，就是周平王。为了酬谢申侯的援立之功，周平王把申侯的小儿子封在屠原（今陕西省合阳县东）。居于屠原的申姓人，就以申屠命姓，称申屠氏。<br>　　3、古代有申徒氏误传为申屠氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　申屠嘉：汉代都尉。文帝时拜丞相，封固安侯。为人廉直，不受私人拜托。幸臣邓通戏殿上，嘉欲杀之，为文帝赦免。景帝时，晁错用事，嘉欲借晁错穿凿宗庙垣事杀错未成，愤恨吐血而死。<br>　　申屠刚：后汉人。性情方直，常慕史鱿、汲黯之为人。平帝时，举贤良方正，因对策时忤上意罢归。光武帝时征拜侍御史，后任尚书令。帝欲出游，刚以陇蜀未平，不宜宴安逸豫，劝谏不听，以头抵舆轮，使车不得行。后数次以谏忤旨，贬为平阴令，终官太中大夫。申屠致远：元朝人。世祖南征时，被经略使乞实力台荐为经略司知事。军中机务，多所谋划。累官淮西江北道肃政廉访司事。所至有风裁。他清修苦节，耻事权贵，聚书万卷，名“墨庄”。著有《忍斋行稿》、《杜诗纂例》、《集古印章》等。<br>　　申屠蟠：东汉学者。郡召为主簿不行，遂隐居精学，博贯五经，兼明图纬。申包胥：姓公孙，封于申，所以号为申包胥。春秋时做楚国大夫。与武员即武子胥有很好的交情。武子胥因为父兄被害逃往吴国的时候曾对包胥说：“我必复楚国。”包胥回答他道：“子能复之，我必能兴之。”后武子胥以吴军攻楚，入其都，包胥跑到秦国求救，不吃不饮在秦廷上哭了七天七夜，秦国终于被感动了，派了五百辆战车去营救楚国，打败了吴军，楚昭王于是得以保国，要奖赏包胥，包胥逃而不受。</p>\n</div>',
    distribution:
      "<p>　　京兆郡：即首都长安直辖区。在今陕西省西安市至华县一带。<br>　　西河郡：战国时魏国置郡。相当于现在山西、陕西两省之间黄河沿岸一带地区。<br></p>",
  },
  {
    names: [
      {
        pinyin: "gōng",
        character: "公",
      },
      {
        pinyin: "sūn",
        character: "孙",
      },
    ],
    history:
      "<p>　　1、出自春秋时各国诸侯的后裔，以爵号为氏。春秋时，各国诸侯不论爵位大小，多喜欢称公。按照周朝制度，国君一般由嫡长子继位，即位前称为太子，其他的儿子便称为公子，公子的儿子则称公孙。他们的后代便有不少人便以公孙为姓，因此，公孙并非一族一姓的后人。据《广韵》载：“古封公之后，皆自称公孙，故其姓多，非一族也。”又据《通志》载：“公孙氏，春秋时诸侯之孙，亦以为氏者，曰公孙氏，皆贵族之称。或眼黄帝姓公孙，因以为氏。”公孙姓望族居扶风（今陕西省咸阳东）、高阳。<br>　　2、出自姬姓，黄帝轩辕的后裔有公孙氏。最初出现的公孙氏是在上古时期。据《路史》载：“神农同母弟勖，嗣少典国君，世为诸侯，后以公孙为姓。轩辕帝初名公孙，后改姬。”所有他的后代里，有部分姓公孙，称公孙氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　公孙鞅--即商鞅。战国时卫国人。后因在秦国变法有功封商十五邑，号商君，因称商鞅。他先在魏国未得重用，而后投秦孝公主持变法，在两次变法中，他"法不阿贵"，推行新法。在孝公死后，被陷害车裂而死，遗有《商鞅方升》等书。公孙戌--战国时齐国人。是为孟尝君门人，自言有三大喜：其一喜谏而得听；其二喜谏而止君之过；其三喜输象床，孟尝君称"喜"，目为贤者。公孙龙--字子秉，战国时赵国人。名辩思想家，他从严格区别事物共性和个性出发，与"异"的矛盾绝对化，认为思维可以脱离"本质"存在，从而提出了"离坚白"、"白马非马"的命题。著有《公孙龙子》。公孙弘--字季。汉朝时淄川人。家贫，以牧豕为业。直到40多岁才学《春秋》杂说。在汉武帝及元光时两度被拜为博士，曾出使匈奴。后在元朔中升任丞相，封平津侯。《史记.商君列传》、《汉书》说公孙弘用自己的俸禄供养故人宾客，家无所余，故后人以他为延揽贤士的典范。</p>\n</div>',
    distribution:
      "<p>　　（缺）公孙姓在大陆和台湾没有列入百家姓前一百位。在古代，孙字可泛指后代人，而公孙两字，也可用来泛指王公贵族的后代。有些王公贵族的后代以公孙的称呼为荣，便相延世代成为姓。还有本古书《通志》说，相传远古时黄帝姓公孙，于是便有这一姓的广泛流传。公孙一姓源远流长，据《路史》上记载，轩辕氏初姓公孙，后改姓姬。由此看来，“公孙”一词，自古以来本身的意义便十分尊荣也就不足为奇了。从《广韵》上记载：“封公之后，自皆称公孙。”可知，春秋时期列国诸侯的子孙，被尊称为公孙。从《通志·氏族略》记载“公孙氏，皆贵者之称。”可见，后来“公孙”的意义延伸了，一般人也尊称贵胄的子弟为公孙。如近来的对人的“公子”称谓。据说春秋时代出身于诸侯之家的公孙，干脆以“公孙”为姓，也称为公孙氏了。由此可见，公孙为姓的中国人中，并不完全是一脉相承自黄帝，其中有一部分是春秋贵族的后裔。不管怎么说，公孙氏的历史悠久、高贵和尊荣，是其他一般姓氏不可比拟的。望族居高阳郡（今山东省临淄县西北一带）；扶风郡（今陕西省咸阳县东一带）。</p>",
  },
  {
    names: [
      {
        pinyin: "zhòng",
        character: "仲",
      },
      {
        pinyin: "sūn",
        character: "孙",
      },
    ],
    history:
      "<p>　　1、出自姬姓。春秋时鲁桓公姬允次子名叫庆父，因排行老二，故世称共仲。他的子孙遂以仲孙为姓，称仲孙氏。庆父乱鲁之后，弑父君主，畏罪出逃，改姓为孟孙氏，但留居于鲁国的他的支庶子孙仍为仲孙氏，世代沿袭为仲孙姓。<br>　　2、出自姜姓，春秋时期，齐国有仲孙氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　仲孙湫：春秋时齐国人，事桓公为大夫。当时鲁国发生灾荒，齐桓公派仲孙湫以“慰问”的名义去侦察情况，回来之后，齐桓公问他：“现在是否可以攻打鲁国？”仲孙湫说：“不可以，因为鲁国有难，不可攻打他，只可更加爱护和帮助他１齐桓公听后很佩服仲孙湫的远见。<br>　　仲孙蔑：即孟献子。春秋时鲁国人。他为人勤俭，体察民情。尝曰：“畜马乘，不察于鸡豚。伐冰之家，不畜牛羊。百乘之家，不畜聚敛之臣。”主张俭用和发展生产。时称贤大夫。</p>\n</div>',
    distribution:
      "<p>　　（缺）仲孙姓在大陆和台湾都没有列入百家姓前一百位。仲是“老二”的意思，古人兄弟中老儿的姓名中常用“仲”字（老大多用“伯”，老三、老四多用“叔”，“季”。）相传奚仲的后代名仲，他的后代就有以仲孙氏为姓的。春秋时，鲁桓公的儿子庆父，字共仲，人称孟孙氏，又号仲孙氏（他的后代因此也有了两种分支，各为孟孙氏及仲孙氏）。如此称呼是为了表示对鲁桓公是皇族之后的尊重。又有宋庄公，其子字仲，后世也有因他而姓仲孙的。还有少部分仲孙的姓，是来自孔子的学生仲由的后代。仲孙复姓望族居高阳郡（今山东临省淄县西北一带）。</p>",
  },
  {
    names: [
      {
        pinyin: "xuān",
        character: "轩",
      },
      {
        pinyin: "yuán",
        character: "辕",
      },
    ],
    history:
      "<p>　　轩辕复姓为黄帝嫡孙，出自有熊氏，亦称为帝鸿氏。黄帝曾居于轩辕之丘，故而得姓轩辕，黄帝的后代子孙遂称轩辕氏。一说黄帝作轩冕之服，教民做衣服，故谓轩辕。又据古代传说，轩辕即天鼋，天鼋变为龙，龙为轩辕部落的图腾，因以得氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　轩辕氏：即黄帝。传说黄帝姓公孙，后因生于姬水改姓姬。国内有熊，故亦称有熊氏。与蚩尤战于涿陆之野，斩杀蚩尤。又败炎帝于阪泉，诸侯尊为天子，以代神农氏。因有土德之瑞，土为黄色，故号黄帝。<br>　　轩辕弥明：唐代诗人。善诗，言其诗作掷地有声。</p>\n</div>',
    distribution:
      "<p>　　轩辕复姓望族居上党（今山西长治）、郃阳（今陕西省合阳县）。</p>",
  },
  {
    names: [
      {
        pinyin: "líng",
        character: "令",
      },
      {
        pinyin: "hú",
        character: "狐",
      },
    ],
    history:
      "<p>　　出自姬姓，源出魏氏所改，以邑名为氏。上古时，周文王有个儿子叫毕以高。毕公高有个孙子叫毕万，毕万在春秋时，在晋国当高官，他有一个曾孙叫魏颗。魏颗有军功，活捉了秦国大将杜回，于是受晋国君主封于令狐，令狐那地方，就在现今山西临猗县西边一带。魏颗的后代，享用令狐的物产，并以封地为姓，称令狐氏。令狐姓是周朝王族的后代。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　令狐邵：字孔叔，太原人，三国时期魏国弘农太守。父仕汉，为乌丸校尉。建安初，袁氏在冀州，邵去本郡家居邺。九年，暂出到武安毛城中。会太祖破邺，遂围毛城。城破，执邵等辈十馀人，皆当斩。太祖阅见之，疑其衣冠也，问其祖考，而识其父，乃解放，署军谋掾。仍历宰守，后徙丞相主簿，出为弘农太守。所在清如冰雪，妻子希至官省；举善而教，恕以待人，不好狱讼，与下无忌。是时，郡无知经者，乃历问诸吏，有欲远行就师，辄假遣，令诣河东就乐详学经，粗明乃还，因设文学。由是弘农学业转兴。至黄初初，徵拜羽林郎，迁虎贲中郎将。<br>　　令狐愚：字公治，三国时期魏国人，是王浚的外甥，黄初年间出任和戎护军，后任曹爽府长史、兖州刺史。曾经与王浚一起密谋废除曹芳，事未行而病卒。后来此阴谋败露，令狐愚被开馆暴尸。<br>　　令狐楚：唐朝大臣、诗人，字殻士，宜州华原人。他举进士后入仕，担任过中书待郎、尚书、仆射等官职，政绩卓著。他还常与名诗人白居易、刘禹锡唱和，李商隐也出自他的门下，但他本人所作的好诗并不多。他的儿子令狐绹也举为进士后入仕，后官至丞相。唐朝时令狐姓一族出了不少名人。<br>　　令狐绹：字子直，令狐楚之子。举进士，擢累左补阙、右司郎中，出为湖州刺史。大中初，召为考功郎中、知制诰，入翰林为学士，进中书舍人，再迁兵部侍郎，俄拜同中书门下平章事（宰相）。懿宗嗣位，出为河中节度使，徙宣武、淮南。僖宗时，终凤翔节度使，封赵国公。<br>　　令狐彰：字伯阳，京兆富平人，其先自炖煌内徙。父濞，为世善吏。始，尉范阳，通民家女，生彰。罢归，留彰母所。既长，志胆沈果，知书传大义，射命中。从安禄山，署左卫郎将。与张通儒入长安，又署左街使。二京平，走河朔。史思明署博、滑二州刺史，屯滑台。时中人杨万定监滑州军，彰欲以节自显，募没人夜度河，悉籍士马州县献款，因万定以闻。肃宗大悦，下书慰劳。彰移壁杏园渡，思明疑之，遣薛岌以兵劫彰。彰谕众以大谊，皆感附死力，遂破岌兵，溃围出，以麾下数百入朝，赐甲第、帷帐、什器，拜滑亳、魏博节度使。河朔平，加兼御史大夫，封霍国公，检校尚书右仆射。<br>　　令狐德棻：唐朝时的著名学者，又名令狐熙子（583-666），宜州华原人。学问广博，博涉文史，早岁知名。高祖武德初为起居舍人，迁秘书丞。时经籍散缺，他向唐高宗奏请，用国库的钱收集天下的古书。他收集大量宝贵的古典书籍后，又组织人整理抄录，太宗贞观中请修梁、陈、周、齐、隋五史，自领周史，在中国文化史上做了一件承前启后的大事。高宗朝官弘文馆学士、太常卿。累迁国子祭酒。暮年著述尤勤，国家凡有修撰，无不参预。卒谥宪。有集传世。</p>\n</div>',
    distribution:
      "<p>　　（缺）令狐姓在大陆与台湾均未进入前一百大姓。所谓令狐，本来是春秋时代的一个地名。这个地方的位置，根据《水经·冻水注》所记载的“令狐即猗氏地”，即今山西省猗氏县的西方。那么，这个地名又是怎样变成复姓的呢？根据《唐书·宰相世系表》记载，原来，春秋时代曾经一度称霸诸侯的晋国，在公元前376年的时候，被其大夫韩、赵、魏三家分晋。当时瓜分晋国的魏氏，是传自周文王的儿子毕公高，毕公高的裔孙毕万，首先在晋国官拜大夫，声势一天比一天盛，到了毕万的孙魏犨，据史料记载，魏犨是春秋时晋国的一位名将，他曾跟随晋文公重耳出亡多年，晋文公即位后封他为大夫，让他继承魏氏的封邑。魏犨当时有个宠妾叫祖姬，据说魏犨每次出征前都要交代家人说：“万一我战死，就让祖姬改嫁，别耽误了她的青春。”但魏犨得了重病，临死前却要家人让祖姬殉葬。他死后，小儿子颗认为他的要求是在神智昏乱时提出来的，与他平时的主张不一致，不应该听从，所以坚持让祖姬改嫁了。后来颗在同秦军杜回交战中节节败退，一直退到一片草地中间。杜回健步如飞，追杀过来。可是当他杀到草地中间的时候，忽然间步履艰难，几次踉跄欲倒。魏颗觉得奇怪，仔细一看，原来有一位老人正伏在草丛中，把长长的草结在一起，形成一道道绊索，杜回到了这里，就像陷入了罗网一样。魏颗大喜，赶快驱车冲上前，把杜回捉住，打败秦军。后来魏颗才知道，原来这位老人是祖姬的父亲，他因为感谢魏颗的救女之恩，特意冒着生命危险来助魏颗一臂之力。为了奖励魏颗的这次功劳，晋景公把令狐之地赏给他做了封邑。魏颗的儿子魏颉就以封邑为姓而姓了令狐，称为令狐氏。至今已有2300多年的历史。令狐姓望出太原郡，主要分布在山西省太原市一带。<br></p>",
  },
  {
    names: [
      {
        pinyin: "xú",
        character: "徐",
      },
      {
        pinyin: "lí",
        character: "离",
      },
    ],
    history:
      "<p>　　徐离姓出自嬴姓。周代时，伯益的后人有封国徐离国（在今安徽临淮关一带），春秋时徐离国被楚国所灭，国人遂以原国名命姓，称徐离氏。以地名命姓。春秋时宋国公族后代伯宗在晋国做官，为三郤所害，他的儿子伯州逃到了楚国的徐离（今安徽凤阳东北）定居，他的后代子孙遂以居住地命姓，称徐离氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　徐离春<br>　　战国时人，她是历史上有名的丑女。额头前突，双眼下凹，鼻孔向上翻翘，头颇大，发稀少，颈部的喉结比男子的还要大，皮肤黑红。她虽然样子难看，但志向远大，学识渊博。当时执政的齐宣王政治腐败，国事昏暗，性情暴躁，喜欢吹捧。徐离春为了拯救国家，冒着杀头的危险，当面一条条地陈述了齐宣王的劣迹。并指出若再不悬崖勒马，就会城破国亡。齐宣王听后大为感动，把徐离春看作是自己正身、齐家、治国的一面镜子。后来，这位身边美女如云的国王，竟把徐离春封为王后。<br>　　徐离昧<br>　　汉朝人，是项羽的大将，素与韩信交好。项羽死后，投奔楚王韩信。高祖刘邦得到消息，韩信谋反，同陈平商议，要韩信逮捕徐离昧。有人告诉韩信，如果把徐离昧斩首，去见高祖，自然无患。于是韩信召徐离昧商议，徐离昧说：“高祖不攻打楚国，是因为我在楚国，如果你捕我献媚，今日我死，明日你亡。”说罢，拔剑自刎。韩信带着徐离昧的头去见高祖，高祖即令武士逮捕韩信。韩信说：“狡兔死，良狗烹，飞鸟尽，良弓藏，敌国破，谋臣亡，天下已定，我固当烹。”<br>　　徐离权<br>　　号和谷子，一号真阳子。唐朝人。生而奇异，长相俊美，有一把大胡子，身长8尺余。传说他遇老人授仙诀，又遇华阳真人、上仙王玄甫，传道入崆峒山。后成为八仙之一。民间成为汉徐离。<br>　　徐离瑾<br>　　字公瑜，宋代庐州合肥人。进士出身，初为简州推官，通判益州。后官德化知县。将嫁女儿时，买回个婢女却是前任知县的女儿，他便与女儿一样嫁了出去。夜里梦见一个穿绿衣的大夫来感谢他，并说：“我向上帝请求，让您的子孙世世代代食俸禄。”仁宗时，官至龙图阁待制，擢开封府推官，出提点两浙刑狱。后徙淮南转运副使，历京西、河东、河北转运使，改江、淮制置发运使。天圣八年三月（1030年），除龙图阁待制权知开封府。未逾月，得疾卒于任。</p>\n</div>',
    distribution:
      "<p>　　复姓“徐离”和单姓“徐”原是一家人，复姓“徐离”居住在一个叫作徐离的地方，即今天的安徽省凤阳一带；而单姓徐源居颍川，在现在的河南省境内。根据《名贤氏族言行类稿》的记载，徐姓是宋微子的后代。桓公的曾孙伯宗在晋国当官，生了儿子州黎，在楚国当官，食采于徐离，就以徐离为氏，子孙有复姓徐离氏、单姓徐氏。楚国有徐仪，徐建，徐子期，与伯牙为友，项羽的部将有徐离昧，徐离昧子接，单姓徐氏，居于颍川长社。而根据《通志·氏族略》记载，徐离姓是晋国伯宗的后代。伯宗是晋的贤士，因为却氏所潜被杀，伯宗的儿子伯州黎逃奔楚国，邑居于徐离，就是濠州，子孙以邑名为氏。徐离复姓望族居会稽（今江苏省南部及浙江省西部一带）、颖川（今河南省许昌一带地区）。</p>",
  },
  {
    names: [
      {
        pinyin: "yǔ",
        character: "宇",
      },
      {
        pinyin: "wén",
        character: "文",
      },
    ],
    history:
      "<p>　　宇文姓起源于辽东，为南单于之后。魏晋时，北方鲜卑族有宇文氏部落，自称是炎帝神农氏的后裔，从祖先葛乌菟起世袭为鲜卑东部大人（十二部落首领）。后来有普回袭任大人，他在打猎时拾到一颗玉玺，上刻“皇帝玺”三字，自以为是天授神权，于是号称宇文氏（当地人呼天为“宇”，呼君为“文”，意即“天子”）。东晋时，宇文氏进据中原，号称宇文国，以宇文为姓，称宇文氏。</p>\n",
    famousNames: "",
    distribution:
      "<p>　　宇文泰：仕魏为关西大都督。北魏孝武帝为高欢所逼，西奔长安依附泰，旧史称西魏，封宇文泰为丞相，专军国大政。后来宇文泰杀孝武帝改立南阳王元宝炬为帝，即文帝。后又废文帝，立太子元廓为恭帝，自任太师，总揽朝政。至其子觉自称天王，废魏，建立北周王朝，追尊宇文泰为太祖文皇帝。<br>　　宇文述：字伯通，代郡武川（今内蒙古自治区武川南）人，出身鲜卑贵族。北周末以军功拜上柱国，封褒国公。隋开皇初，拜右卫大将军，平陈之役，任行军总管，率兵三万从六合渡江。时晋王杨广镇扬州，欲拉拢述附己，遂奏请文帝任述为寿州刺史总管。杨广与述计谋夺太子位，述建议广收买朝中宰相杨素等。于是述、素二人共谋立杨广为太子。及后炀帝即位，宇文述参预朝政，与苏威并重。帝后以述为左卫大将军，封许国公，总领军事。后从炀帝幸榆林，西击吐谷浑。第二年又随炀帝西幸，登燕支山，西域诸国来朝。宇文述善于供奉，深得炀帝欢心，言无不从，势倾朝廷，宠遇莫与为比。但性贪鄙，接受各方馈赠无数，金宝山积，僮仆千人，骄奢无度。大业八年（612年），炀帝出征高丽，以宇文述率军渡鸭绿江，述自恃小胜而骄，中高丽军诱兵之计，军至平壤，被高丽军掩击，大溃不止，三十万五千隋军惟余二千七百人逃归辽东。炀帝大怒，除述为民。次年又复起用，从征高丽。适杨玄感起兵反隋，炀帝回师命述讨玄感，大破之。十二年，宇文述劝炀帝幸江都。不久，述在江都病重。述子化及、智及曾因获罪被谴，故述在临死前，乞请炀帝照顾二子。炀帝于是以化及为右屯卫将军，智及为将作少监。<br>　　宇文护：宇文邕堂兄。从宇文泰征讨有功，为泰所信任。泰死后，辅佐泰之子觉建立北周王朝，任大冢宰，掌握军政大权。后毒死觉，立泰之子毓为帝（明帝）。继又杀毓，立毓之弟邕为帝（武帝）。建德元年，宇文邕与群侍密谋，乘宇文护入宫见太后时击杀于宫内。<br>　　宇文邕：南北朝时北周皇帝。560年即位在位18年。小字袻罗突。武川（今内蒙自治区古武川）人。宇文泰第四子。武成二年（560年），权臣宇文护毒死明帝宇文毓，立宇文邕为帝。建德元年（572年）宇文邕杀宇文护，始亲政。宇文邕生活俭朴，对下严酷少恩，果断明决，耐劳刻苦，征伐时常躬亲行阵。四年他决定伐齐并亲自统军围攻金墉城（今河南省洛阳），但因病还师。次年又率大军伐齐，几路并进，攻克平阳（今山西省临汾）。围晋阳(今山西太原西南)时因军事失利，自己仅得免。其后听从宇文忻“死中求生，败中取胜”之议，终攻克晋阳。六年，入邺，灭北齐。后豁免境内杂户、奴婢等为良人。建德二年，宇文邕确决三教先后，以儒为先，道次之，佛教最后。次年禁佛、道二教，沙门、道士被令还俗，为历史上“三武灭佛”之一。后突厥强盛，视北齐、北周为在南两儿。宇文邕不得不娶突厥公主为后，灭齐之后，于宣政元年（578年）率军分五道伐突厥，惜未成行而病死。<br>　　宇文虬：北周人。少从征讨，累以功封南安侯。擒宝泰、收复弘农，及沙苑、河桥之战，皆有功。又从独孤信讨伐梁企定破之。累迁骠骑大将军，开府仪同三司。虬每经行阵，必身先士卒，故上下同心，战无不克，后除全州刺史，大将军卒。<br>　　宇文恺：隋代有名的城市规划、建筑设计大师。字安乐（555-612），祖上是鲜卑人。出生于长安城（今西安市西北部）。他的父亲宇文贵从小就喜欢武艺、厌倦诗文，史书记载宇文贵年少时曾跟随老师学习，一天他却扔下书本对老师说道；“男儿应当骑马提剑以取功名，怎么能象老师一样做博士呢？”后来就从军作战，多次荣立战功，受到皇上的封赏，逐渐成为一个显赫家族。宇文恺的大哥、二哥也和其父一样因军功显赫而被册封要职。宇文恺因是功臣之后，2岁被赠爵双泉县伯，6岁进封为安平郡公，随后又累获许多荣誉。但宇文恺并没有追随父兄骑马打仗，他从小就不喜欢弓马、刀枪之类的武事，而喜欢博览群书、学习知识，尤其喜爱建筑方面的知识，年轻时就以博学多才而闻名。20多岁时曾被任用为上开府、工部匠师中大夫，成为北周政权主管建筑的管员。主持建造许多大型建筑，尤其是主持建造隋朝新都大兴城和东都洛阳城，为以后各代都城建设树立了样板，展示了宇扒岂高超的建筑技艺和卓越的设计才华。<br>　　宇文忻：字仲乐，宇文恺之兄，本朔方人，徙京兆。祖莫豆于，魏安平公。父贵，周大司马、许国公。忻幼而敏慧，为儿童时，与群辈游戏，辄为部伍，进止行列，无不用命，有识者见而异之。年十二，能左右驰射，骁捷若飞。恒谓所亲曰：“自古名将，唯以韩、白、卫、霍为美谈，吾察其行事，未足多尚。若使与仆并时，不令竖子独擅高名也。”其少小慷慨如此。年十八，从周齐王宪讨突厥有功，拜仪同三司，赐爵兴固县公。韦孝宽之镇玉壁也，以忻骁勇，请与同行。屡有战功，加位开府、骠骑将军，进爵化政郡公，邑二千户。<br>　　宇文庆：字神庆，隋代河南省洛阳人，沉深有器局，少以聪敏见知。周初，受业东观，颇涉经史。既而谓人曰：“书足记姓名而已，安能久事笔砚，为腐儒之业１于时文州民夷相聚为乱，庆应募从征。贼据保岩谷，径路悬绝，庆束马而进，袭破之，以功授都督。卫王直之镇山南也，引为左右。庆善射，有胆气，好格猛兽，直甚壮之。稍迁车骑大将军、仪同三司、柱国府掾。及诛宇文护，庆有谋焉，进授骠骑大将军，加开府。后从武帝攻河阴，先登攀堞，与贼短兵接战，良久，中石乃坠，绝而后苏。帝劳之曰：“卿之馀勇，可以贾人也。”复从武帝拔晋州。其后齐师大至，庆与宇文宪轻骑而觇，卒与贼相遇，为贼所窘。宪挺身而遁，庆退据汾桥，众贼争进，庆引弓射之，所中人马必倒，贼乃稍却。及破高纬，拔高壁，克并州，下信都，禽高湝，功并居最。周武帝诏曰：“庆勋庸早著，英望华远，出内之绩，简在朕心。戎车自西，俱总行阵，东夏荡定，实有茂功。高位缛礼，宜崇荣册。”于是进位大将军，封汝南郡公，<br>　　宇文融：唐代京兆万年人，明辨有吏干。开元初，拜监察御史，充使搜括户口，奏置劝农判官十人，分行天下，颇扰人不便。进御史中丞，出为魏州刺史。请复九河旧道，开稻田以利人，回易陆运。入为鸿胪卿，兼户部侍郎，转黄门侍郎，同中书门下平章事。荐宋璟为右丞相，裴耀卿、许景先为侍郎，甚允朝廷之望。未几罢相，坐事贬严州卒。<br>　　宇文化及：隋代叛臣。代郡武川（今属内蒙古自治区）人。炀帝时为右屯卫将军。大业十四年（618年）于江都（今江苏省扬州）与司马德堪发动兵变，杀炀帝，立秦王杨浩，任大丞相。旋被李密击破，率众走魏县（今河北省大名东），杀死杨浩，自立为帝。次年为窦建德擒杀。<br>　　宇文虚中：金代诗人。字叔通（1079-1146），别号龙溪。成都华阳（今成都市）人。北宋徽宗大观三年（1109年）进士，官至资政殿大学士。南渡后任黄门侍郎。南宋高宗建炎二年（1128年）使金，被软禁。获释后仕金为礼部尚书、翰林学士承旨,封河内郡开国公，并被尊为“国师”。皇统二年（1142年）金移文南宋、索其家属北迁。皇统六年（1146年），上京会宁府的一部分宋朝俘虏密谋奉虚中为帅，夺兵仗南奔，事觉，诏系狱，鞫治无状，仍被杀。宇文虚中的诗歌创作可以分为前后两期。写于两宋时的作品存留不多，诗较平谈，主要抒发个人的羁旅闲愁。入金被囚期间诗风一变，每多感愤之辞，如《在金日作三首》其一：“满腹诗书漫古今，频年流落易伤心。南冠终日囚军府,北雁何时到上林？开口摧颓空抱朴,胁肩奔走尚腰金。莫邪利剑今安在，不斩□邪恨最深１其他一些诗，如《上乌林天使》、《春日》、《己酉岁书怀》、《过居庸关》、《安定道中》等，或批评金人背盟，或写出塞、思乡之情，都较有内容和感情，与逃禅之类写消沉之思的作品形成鲜明的对照。<br>　　宇文成都：《说唐》、《兴唐传》等书中人物。宇文化及之子，称为隋朝第二条好汉，使一条400斤重凤翅镏金镋，传说为九天应元雷神普化天尊转世。曾与天下第一好汉李元霸比武，手提三百斤金狮上金殿，面不改色。宇文化及篡位，命宇文成都入宫杀死隋炀帝，封武安王子。后十八家反王讨宇文化及，宇文成都被李元霸所杀。</p>\n",
  },
  {
    names: [
      {
        pinyin: "zhǎng",
        character: "长",
      },
      {
        pinyin: "sūn",
        character: "孙",
      },
    ],
    history:
      "<p>　　1、出自北魏皇室沙莫雄，为拓跋氏所改。长孙复姓本为拓跋氏，为后魏献文帝第三兄拓跋嵩之后。北魏道武帝拓跋圭的曾祖父拓跋郁律有两个儿子：大儿子沙英雄为南部大人，号拓跋氏；小儿子什翼健就是拓跋圭的祖父，拓跋圭建立北魏称帝后，因沙英雄是曾祖父的儿子，就赐他的儿子为长孙氏。长孙嵩后来位至太尉，封为北平王；他的侄子长孙道生屡建战功，位至宰相，封为上党王。拓跋嵩因有功于魏，世袭为王族大人。孝文帝时，以拓跋姓为魏朝皇族宗室之长门，故改姓为长孙氏。<br>　　2、出自北魏之前有长孙氏。据《汉书·艺文志》和《孝经》上记载有长孙顺“长孙氏说”二篇，西汉时期已有长孙氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　长孙晟：字季晟（552-609），长孙无忌之父，隋朝洛阳人。自幼习武，年18岁为司卫上士，高祖一见嗟异。开皇中突厥南侵，晟口陈形势，手画山川，定其虚实，皆如指掌。遂拜为车骑将军兼受降使者，敌称他的马声与弓声为“霹雳闪电”，闻风丧胆。终为右骁将军。卒谥献。<br>　　长孙俭：本名庆明。北周洛阳人。少方正有操行。时四方骚动，俭从左卫将军攻破宿勒明达等，以功赐爵索虞侯。文帝甚敬之，表授荆州刺史、东南道行台仆射。黎民树碑刻颂。又诣阙留，后征授大行台尚书，兼相府司马。封昌宁公，升大将军，镇荆州。以病还为夏州总管卒。<br>　　长孙操：唐王朝建国的当年（公元618年），高祖李渊诏令东道大行台长孙操为陕州刺史。长孙操上任伊始，便带人实地察看利人渠，决定在此渠的基础上扩大规模，增加水量。与苏威的无坝引水工程不同，长孙操在交口东面的橐水上筑起石坝，并加宽加高水渠，使渠水比原来的利人渠扩大了许多倍。于是，人们便将此渠称作“广济渠”。<br>　　长孙皇后：唐太宗李世民的皇后。她曾协助李世民发动“玄武门之变”，夺取政权。李世民即位后，她常劝其提倡节俭，重视法制，信用贤臣，深得唐太宗的敬重。她还从封建伦理观出发，编写了《女则》10卷。<br>　　长孙无忌：字辅机，晟子。唐朝洛阳人，唐太宗皇后之兄。博涉文史，有谋略。从太宗李世民定天下，功居第一迁吏部尚书，封为齐国公，又徙赵国公、太子太师，后为高宗时辅政大臣，进授太尉，兼修国史。后因反对高宗立武则天为后，被放逐黔州，自缢身亡。撰有《唐律疏议》。<br>　　长孙顺德：李世民文德皇后的族叔。从李渊父子太原起兵，一路上攻城陷地，多参与其间，高祖即位，封薛国公。玄武门之变站在李世民一边，率兵与李建成余党大战。太宗即位后以宫女赐之。贞观年间，长孙顺德居官贪婪，几次被削爵，最后病发身死。李世民仍念旧情旧功，赠荆州都督，谥曰襄。贞观十三年，封邳国公。</p>\n</div>',
    distribution:
      "<p>　　长孙姓在大陆和台湾都没有列入百家姓前一百位。古代南北朝时期，北魏的王族中有一位叫拓跋嵩，因为功劳大，朝廷封他为王族大人，这个封号可以世代承袭。到了北魏孝文帝在位时，孝文帝在位时，孝文帝向汉文化学习，将拓跋姓改为元姓，孝文帝的姓名叫元宏。而拓跋嵩的后代，就改姓为长孙，意思是王族长门的子孙，这个姓和王族大人的封号也相呼应。长孙姓望族居济阳（今山东省定陶西北，一说河南省兰封东北）。据《郡望百家姓》记载：长孙氏望出济阳郡。晋惠帝时将陈留郡之一部分置济阳郡，在今河南省兰考县一带。<br></p>",
  },
  {
    names: [
      {
        pinyin: "mù",
        character: "慕",
      },
      {
        pinyin: "róng",
        character: "容",
      },
    ],
    history:
      '<p>　　1、出自汉代，以寺庙名称命姓，称慕容氏。<br>　　2、慕容氏是鲜卑族主要部落之一。三国时，鲜卑族首领莫护跋率领族人迁居辽西，曾随同司马懿征讨割据辽东的公孙渊，立下战功，被封为率义王。莫护跋在荆城以北（今河北省昌黎县境内）建立国家。据说当时北方的汉人流行戴步摇冠（一种带有悬垂装饰物的帽子），莫护跋见了也很喜欢，也做了一顶，整天戴在头上。鲜卑人见了他这种打扮，都称他为"步摇"，因当地语言"步摇"同"慕容"读音相近，所以传到后来就成了"慕容"。莫护跋的后人便干脆以此作为部落的名称。西晋时，慕容廆占领燕北、辽东一带，自称鲜卑大单于，他的儿子慕容皝后来建立前燕国，从此正式以慕容为姓。东晋十六国时，慕容氏在北方先后建立了前燕、后燕、西燕、南燕等国，前后历时七十多年。</p>\n',
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　慕容姓名人，隋朝有大将军慕容三庄，宋代有检校太尉慕容廷钊、刑部尚书慕容延超。慕容姓还建立过前燕、后燕、北燕、南燕、西燕政权。<br>　　前燕有大司马慕容恪（慕容皝之子），后燕有冠军将军慕容垂，燕国有修文学士慕容善，隋朝有大将军慕容三藏，宋代有检校太尉慕容延钊、刑部尚书慕容彦超。<br>　　慕容复：北宋姑苏人氏，为大燕后裔，一心复国，后自杀。</p>\n</div>',
    distribution:
      "<p>　　雁门郡：战国时赵武灵王置郡。秦、汉沿之。相当于现在山西省代县一带地区。</p>",
  },
  {
    names: [
      {
        pinyin: "sī",
        character: "司",
      },
      {
        pinyin: "tú",
        character: "徒",
      },
    ],
    history:
      "<p>　　1、出自姬姓，是舜帝的后代。尧帝为炎黄部落首领时，舜为尧的司徒官，执掌和管理土地事务，故又名土司。舜的后代子孙有的以其职官命姓，称司徒氏。<br>　　2、春秋时，卫国大夫夏丁氏夏戊的儿子期任司徒，其后也称司徒氏。司徒是上古官名，相传尧、舜时已经设置，主管教化民众和行政事务。夏、商、周时期，朝廷都设有司徒官，为六卿之一，称为地官大司徒，职位相当于宰相。春秋时列国也多设有这个职位，有以官职命氏的，就成为司徒氏。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　司徒映：唐朝人。太和元年时（公元827年），唐文宗即位，深知两朝之弊，励精求治，任司徒映为太常卿。，出宫女3000余人，放五坊鹰犬，省冗食1200余人，政号清明。不料数年后，宦官挠权，勾心斗角，奢侈浪费，腐败回潮，文宗仁而少断，制之不得其术，遂成甘露之变。司徒映目睹此情此景，毅然决定辞官还乡，不再在朝廷做不清明的官。司徒诩：五代时南汉人。厉永年间任项城县令，有政绩，汉初升为礼部侍郎。周世宗即位后，留意雅乐，议欲考其正音，而诩为足疾病所苦，居多告假，遂命以本官至仕。春秋时陈国有大夫司徒卯，五代后汉有司徒羽，宋朝有进士司徒公绰、司徒肃。</p>\n</div>',
    distribution:
      "<p>　　（缺）司徒姓在大陆和台湾都没有列入百家姓前一百位。司徒姓起源于先秦历代都设司徒这一官职，掌管国家的行政事务。有的司徒后代就把官职作为自己的姓氏，称为司徒氏。司徒姓同司空、司马等姓，司徒起初特指官名。早在商周时，就设有司徒一职，主管民众、土地、教化、行政事务。周朝称为地官大司徒，职位类似于宰相。春秋各国多有沿袭。相传舜作过尧的司徒，其后代就以官名司徒为姓。卫国有大夫夏戊之子夏朝任司徒，后来也有子孙称司徒氏。</p>",
  },
  {
    names: [
      {
        pinyin: "sī",
        character: "司",
      },
      {
        pinyin: "kōng",
        character: "空",
      },
    ],
    history:
      "<p>　　1、出自姒姓，是大禹的后代，以官职名为氏。尧为部落首领时，禹官至司空，其后代子孙有的以职官命姓，称司空氏。<br>　　2、出自陶唐氏，是尧的后代，以官职名为氏。春秋时期，只有晋国设置有司空官，其他各诸侯国均未设此官。尧的后代隰叔及其孙仕痌，都曾在晋国任过司空，其后代子孙遂以祖上职官命姓，称司空氏。“司空”这个官职，是从尧帝以来就设有的，但历代的职务有所不同。如尧、舜、禹时代的司空，主管治理水土；西周时代的司空，主管建筑工程，制造车服器械，监督手工业奴隶，为六卿之一；到汉成帝绥和元年改御史大夫为大司空，后去“大”字，称司空，主管囚徒。在西周以前还未发现有人用“司空”这个官名作为姓。直到春秋时，晋国有个大夫叫士蒍，他担任“司空”官职以后，其子孙始以官名为姓，世代相传姓司空。</p>\n",
    famousNames:
      ' <div class="ly_title"><strong>家族名人</strong></div> <div class="lunyu_jies"><p>　　司空图：唐朝河中（山西省永济）人，咸通年间进士，累官礼部郎中，因避战乱隐居中条山王官峪。朱温篡唐后，召司空图为礼部尚书，他坚拒不就。唐哀帝被朱温弑后，司空图绝食而死。著有《诗品》二十四卷，以四言韵语咏述诗的二十四种境界，对后世诗评有很大影响。<br>　　司空曙：唐朝诗人，洺州广平（今河北省永年东南）人，官至虞部郎中。他擅长写五言律诗，内容多为送别酬答和羁旅漂泊，为“大历十才子”之一。<br>　　司空颋：唐僖宗时举进士不弟，后入梁任太府少卿，旋即降晋，当时都虞侯张裕多过失，司空颋屡绳之以法，后被张裕所诬，庄宗族杀之。<br>　　司空颋：唐僖宗时举进士不弟，后入梁任太府少卿，旋即降晋，当时都虞侯张裕多过失，司空颋屡绳之以法，后被张裕所诬，庄宗族杀之。</p>\n</div>',
    distribution:
      "<p>　　（缺）司空姓在大陆和台湾都没有列入百家姓前一百位。司空是古代的一个官名，相传帝少昊时就已设置，专管水利土木工程建设。据说大禹就担任过帝尧时的司空。春秋时期，晋国的土也担任过司空，他们的后代都有姓司空的。刚出现“司空”是官名。相传帝少昊设立了司空一职，主管国家的水利、土木和交通工程建设。这个官职因其为民生所不可或缺，后世一直沿用。更在周朝，被列为六卿之一，可见其重要性。相传在帝尧时，大禹任司空，治水有功。他的子孙中就有以司空为姓。在春秋时，又有隰叔的孙子在晋国任司空，他的后代也有因此而姓司空的。<br></p>",
  },
];
